-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: May 06, 2026 at 11:09 AM
-- Server version: 10.6.11-MariaDB
-- PHP Version: 7.4.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `theskruc_nabudget`
--

-- --------------------------------------------------------

--
-- Table structure for table `activity`
--

CREATE TABLE `activity` (
  `act_id` int(11) NOT NULL COMMENT 'รหัสกิจกรรม',
  `act_name` varchar(255) NOT NULL COMMENT 'ชื่อกิจกรรม',
  `pro_id` int(11) NOT NULL COMMENT 'รหัสโครงการfk',
  `bgt_id` int(11) NOT NULL COMMENT 'รหัสประเภทงบประมาณ',
  `act_money` decimal(12,2) NOT NULL COMMENT 'เงินที่ได้รับจัดสรร',
  `act_balance` decimal(12,2) NOT NULL COMMENT 'จำนวนเงินคงเหลือ',
  `act_user` varchar(100) NOT NULL COMMENT 'ผู้รับผิดชอบกิจกรรม',
  `create_by` int(11) NOT NULL,
  `create_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT 'วันที่ทำรายการ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Dumping data for table `activity`
--

INSERT INTO `activity` (`act_id`, `act_name`, `pro_id`, `bgt_id`, `act_money`, `act_balance`, `act_user`, `create_by`, `create_at`) VALUES
(1, 'ชำระค่าสาธารณูปโภค 1/2569', 1, 1, '1500000.00', '1500000.00', 'นางสาวจารุวรรณ  พุกภัย', 1, '2026-04-20 13:26:10'),
(2, 'ชำระค่าสาธารณูปโภค 2/2569', 1, 1, '1500000.00', '1500000.00', 'นางสาวจารุวรรณ  พุกภัย', 1, '2026-04-20 13:26:10'),
(3, 'ซ่อมบำรุงรถยนต์ และรถจักรยานยนต์โรงเรียน 1/2569', 2, 1, '88500.00', '88500.00', 'นายสมชาย  เที่ยงดี', 1, '2026-04-20 13:26:10'),
(4, 'ซ่อมบำรุงรถยนต์ และรถจักรยานยนต์โรงเรียน 2/2569', 2, 1, '61500.00', '61500.00', 'นายสมชาย  เที่ยงดี', 1, '2026-04-20 13:26:10'),
(5, 'จัดคิวตารางการใช้รถยนต์โรงเรียน 1/2569', 3, 1, '100000.00', '100000.00', 'นางสาวภัสสร  ตรีสร', 1, '2026-04-20 13:26:10'),
(6, 'น้ำมันเชื้อเพลิงรถยนต์โรงเรียน1/2569', 3, 1, '0.00', '0.00', 'นางอนงค์นาฏ  พรมดี', 1, '2026-04-20 13:26:10'),
(7, 'จัดคิวตารางการใช้รถยนต์โรงเรียน 2/2569', 3, 1, '100000.00', '100000.00', 'นางสาวภัสสร  ตรีสร', 1, '2026-04-20 13:26:10'),
(8, 'น้ำมันเชื้อเพลิงรถยนต์โรงเรียน2/2569', 3, 1, '0.00', '0.00', 'นางอนงค์นาฏ  พรมดี', 1, '2026-04-20 13:26:10'),
(9, 'สนับสนุนการเดินทางไปเยี่ยมบ้านนักเรียน', 4, 1, '75000.00', '75000.00', 'นายนพดล  คล้ายใจตรง', 1, '2026-04-20 13:26:10'),
(10, 'สนับสนุนการเดินทางไปราชการ', 4, 1, '137500.00', '137500.00', 'นางนิลุบล  สำเภา', 1, '2026-04-20 13:26:10'),
(11, 'พัฒนาทักษะนักเรียนผ่านกิจกรรมนอกสถานศึกษา', 4, 1, '75000.00', '75000.00', 'นางนิลุบล  สำเภา', 1, '2026-04-20 13:26:10'),
(12, 'สนับสนุนการเดินทางไปราชการ', 4, 1, '137500.00', '137500.00', 'นางนิลุบล  สำเภา', 1, '2026-04-20 13:26:10'),
(13, 'พัฒนาทักษะนักเรียนผ่านกิจกรรมนอกสถานศึกษา', 4, 1, '75000.00', '75000.00', 'นางนิลุบล  สำเภา', 1, '2026-04-20 13:26:10'),
(14, 'พัฒนางานอำนวยการ', 5, 1, '15000.00', '15000.00', 'นางเพลิน  แก้วสุข', 1, '2026-04-20 13:26:10'),
(15, 'ประชุมสามัญประจำเดือน 1/2569', 5, 1, '16000.00', '16000.00', 'นางสุมลรัตน์  ต่ายตระเวน', 1, '2026-04-20 13:26:10'),
(16, 'ประชุมสามัญประจำเดือน 2/2569', 5, 1, '19000.00', '19000.00', 'นางสุมลรัตน์  ต่ายตระเวน', 1, '2026-04-20 13:26:10'),
(17, 'นิเทศการจัดการเรียนรู้ของครูทุกกลุ่มสาระการเรียนรู้ 1/2569', 6, 1, '1500.00', '1500.00', 'นางปาลิกา  ทัตเศษ', 1, '2026-04-20 13:26:10'),
(18, 'นิเทศการจัดการเรียนรู้ของครูทุกกลุ่มสาระการเรียนรู้ 1/2569', 6, 1, '1500.00', '1500.00', 'นางปาลิกา  ทัตเศษ', 1, '2026-04-20 13:26:10'),
(19, 'การประเมินคุณภาพภายนอกสถานศึกษา (รอบ 5) จาก สมศ.', 7, 1, '0.00', '0.00', 'นางปคุณาณัช  ทองแจ่ม', 1, '2026-04-20 13:26:10'),
(20, 'การประเมินคุณภาพภายในสถานศึกษาของปีการศึกษา 2568', 7, 1, '1800.00', '1800.00', 'นางปคุณาณัช  ทองแจ่ม', 1, '2026-04-20 13:26:10'),
(21, 'การพัฒนาระบบประกันคุณภาพภายในและมาตรฐานการศึกษา 1/2569', 7, 1, '3000.00', '3000.00', 'นางปคุณาณัช  ทองแจ่ม', 1, '2026-04-20 13:26:10'),
(22, 'การพัฒนาระบบประกันคุณภาพภายในและมาตรฐานการศึกษา 2/2569', 7, 1, '10200.00', '10200.00', 'นางปคุณาณัช  ทองแจ่ม', 1, '2026-04-20 13:26:10'),
(23, 'พิธีทบทวนคำปฏิญาณและสวนสนามเนื่องในวันคล้ายวันสถาปนาคณะลูกเสือแห่งชาติ', 8, 1, '12000.00', '12000.00', 'นางปาลิกา  ทัตเศษ', 1, '2026-04-20 13:26:10'),
(24, 'พิธีเข้าประจำหมู่ยุวกาชาด', 8, 1, '5000.00', '5000.00', 'นางสาวสุมลรัตน์  ต่ายตระเวน', 1, '2026-04-20 13:26:10'),
(25, 'กิจกรรมชุมนุม', 8, 2, '1500.00', '1500.00', 'นางสาวปนัดดา  กองมนต์', 1, '2026-04-20 13:26:10'),
(26, 'รับรายงานตัวและขึ้นทะเบียนนักศึกษาวิชาทหาร', 8, 2, '1400.00', '1400.00', 'นายวิเชียร  สุทธหลวง', 1, '2026-04-20 13:26:10'),
(27, 'การฝึกนักศึกษาวิชาทหาร(ภาคปกติ)', 8, 2, '15600.00', '15600.00', 'นายวิเชียร  สุทธหลวง', 1, '2026-04-20 13:26:10'),
(28, 'กิจกรรมเพื่อสังคมและสาธารณประโยชน์', 8, 2, '6000.00', '6000.00', 'นายรัฐภูมิ  เอี่ยมรอด', 1, '2026-04-20 13:26:10'),
(29, 'ลดเวลาเรียนเพิ่มเวลารู้', 8, 1, '0.00', '0.00', 'นางสาวภัทร์ธีรา  วงษาวดี', 1, '2026-04-20 13:26:10'),
(30, 'สนับสนุนส่งเสริมงานกลุ่มกิจกรรมพัฒนาผู้เรียน', 8, 1, '10000.00', '10000.00', 'นางปาลิกา  ทัตเศษ', 1, '2026-04-20 13:26:10'),
(31, 'พิธีถวายราชสดุดี เนื่องในวันสมเด็จพระมหาธีรราชเจ้า', 8, 1, '8000.00', '8000.00', 'นางปาลิกา  ทัตเศษ', 1, '2026-04-20 13:26:10'),
(32, 'พิธีปฏิญาณตนและสวนสนามเนื่องในวันคล้ายวันสถาปนายุวกาชาดไทย', 8, 1, '10000.00', '10000.00', 'นางสาวสุมลรัตน์  ต่ายตระเวน', 1, '2026-04-20 13:26:10'),
(33, 'กิจกรรมชุมนุม', 8, 2, '1500.00', '1500.00', 'นางสาวปนัดดา  กองมนต์', 1, '2026-04-20 13:26:10'),
(34, 'ลดเวลาเรียนเพิ่มเวลารู้', 8, 1, '0.00', '0.00', 'นางสาวภัทร์ธีรา  วงษาวดี', 1, '2026-04-20 13:26:10'),
(35, 'พัฒนางานสำมะโนนักเรียน 1/2569', 9, 1, '7160.00', '7160.00', 'นางวิมลรัตน์  รูปแก้ว', 1, '2026-04-20 13:26:10'),
(36, 'พัฒนางานสำมะโนนักเรียน 2/2569', 9, 1, '32840.00', '32840.00', 'นางวิมลรัตน์  รูปแก้ว', 1, '2026-04-20 13:26:10'),
(37, 'พิธีมอบใบประกาศนียบัตรนักเรียนชั้น มัธยมศึกษาปีที่ 3 และ 6', 9, 1, '18000.00', '18000.00', 'นางวิมลรัตน์  รูปแก้ว', 1, '2026-04-20 13:26:10'),
(38, 'การจัดทำแผนบูรณาการจัดการเรียนรู้ตามหลักปรัชญาของเศรษฐกิจพอเพียง 1/2569', 10, 1, '0.00', '0.00', 'นายสุรัตน์  แซงศรีนวล', 1, '2026-04-20 13:26:10'),
(39, 'การจัดนิทรรศการภายในแหล่งเรียนรู้บ้านของพ่อ', 10, 1, '32000.00', '32000.00', 'นายสุรัตน์  แซงศรีนวล', 1, '2026-04-20 13:26:10'),
(40, 'ฐานบูรณาการจัดการเรียนรู้ตามหลักปรัชญาของเศรษฐกิจพอเพียง', 10, 1, '18000.00', '18000.00', 'นายสุรัตน์  แซงศรีนวล', 1, '2026-04-20 13:26:10'),
(41, 'การจัดทำแผนบูรณาการจัดการเรียนรู้ตามหลักปรัชญาของเศรษฐกิจพอเพียง 2/2569', 10, 1, '0.00', '0.00', 'นายสุรัตน์  แซงศรีนวล', 1, '2026-04-20 13:26:10'),
(42, 'ทุนการศึกษา', 11, 1, '0.00', '0.00', 'นางสาวสุภาพร  ศรีโยธา', 1, '2026-04-20 13:26:10'),
(43, 'กองทุนเงินให้กู้ยืมเงินเพื่อการศึกษา (กยศ.)', 11, 1, '0.00', '0.00', 'นางสาวสุภาพร  ศรีโยธา', 1, '2026-04-20 13:26:10'),
(44, 'แนะแนวการศึกษาต่อ', 11, 1, '5000.00', '5000.00', 'นางสาวกนกธรณ์  สร้อยโต', 1, '2026-04-20 13:26:10'),
(45, 'แนะแนวสัญจร', 11, 1, '5000.00', '5000.00', 'นางสาวกนกธรณ์  สร้อยโต', 1, '2026-04-20 13:26:10'),
(46, 'จัดซื้อหนังสือ - สื่อการเรียนรู้และซ่อมแซมครุภัณฑ์ห้องสมุด', 12, 1, '18900.00', '18900.00', 'นายชัชวานนท์  สงคราม', 1, '2026-04-20 13:26:10'),
(47, 'ปรับปรุงห้องอ่านหนังสือ(กั้นกระจก ชั้น 2 สำหรับติดเครื่องปรับอากาศ)', 12, 1, '42000.00', '42000.00', 'นายชัชวานนท์  สงคราม', 1, '2026-04-20 13:26:10'),
(48, 'จัดซื้อเครื่องปรับอากาศชนิดเคลื่อนที่ (ขนาดไม่น้อยกว่า 18,000 BTU)', 12, 1, '20500.00', '20500.00', 'นายชัชวานนท์  สงคราม', 1, '2026-04-20 13:26:10'),
(49, 'ส่งเสริมนิสัยรักการอ่านและสัปดาห์ห้องสมุด', 12, 1, '3600.00', '3600.00', 'นายชัชวานนท์  สงคราม', 1, '2026-04-20 13:26:10'),
(50, 'จัดซื้อซ่อมแซมวัสดุครุภัณฑ์', 12, 1, '5000.00', '5000.00', 'นายชัชวานนท์  สงคราม', 1, '2026-04-20 13:26:10'),
(51, 'อบรมนักเรียนเพื่อนที่ปรึกษา YC : Touth Counseler) (อุดหรุนรายหัว)', 13, 1, '3600.00', '3600.00', 'นางสาวกนกธรณ์  สร้อยโต', 1, '2026-04-20 13:26:10'),
(52, 'อบรมนักเรียนเพื่อนที่ปรึกษา YC : Touth Counseler) (กิจกรรมพัฒนาคุณภาพผู้เรียน)', 13, 2, '26700.00', '26700.00', 'นางสาวกนกธรณ์  สร้อยโต', 1, '2026-04-20 13:26:10'),
(53, 'ส่งเสริมสถานศึกษาต้นแบบกิจกรรมนักเรียนเพื่อนที่ปรึกษา YC : Touth Counseler) วิถีใหม่', 13, 1, '0.00', '0.00', 'นางสาวกนกธรณ์  สร้อยโต', 1, '2026-04-20 13:26:10'),
(54, 'ส่งเสริมสถานศึกษาต้นแบบกิจกรรมนักเรียนเพื่อนที่ปรึกษา YC : Touth Counseler) วิถีใหม่', 13, 1, '0.00', '0.00', 'นางสาวกนกธรณ์  สร้อยโต', 1, '2026-04-20 13:26:10'),
(55, 'รับสมัครนักเรียนใหม่ ม.1 และม.4', 14, 1, '60000.00', '60000.00', 'นางสาวกมลรัตน์  จันทร์น้อย', 1, '2026-04-20 13:26:10'),
(56, 'จัดซื้ออุปกรณ์ สื่อ วัสดุ จัดหาสื่อเทคโนโลยีและรวบรวม ปรับปรุง และพัฒนาสื่อและอุปกรณ์', 15, 1, '10000.00', '10000.00', 'นางสาวบุษรินทร์  ตะกรุดแก้ว', 1, '2026-04-20 13:26:10'),
(57, 'เตรียมความพร้อมของนักเรียนชั้นมัธยมศึกษาปีที่3', 16, 1, '74100.00', '74100.00', 'นางพิมพ์ลภัทร์  สิมานุรักษ์', 1, '2026-04-20 13:26:10'),
(58, 'เตรียมความพร้อมของนักเรียนชั้นมัธยมศึกษาปีที่3', 16, 1, '152700.00', '152700.00', 'นางสาวกฤติญาภรณ์  จงอุ้มกลาง', 1, '2026-04-20 13:26:10'),
(59, 'ประสานความร่สมมือกับชุมชนในด้านวิชาการ', 16, 1, '5000.00', '5000.00', 'นางสิรินารถ  สรรพอาสา', 1, '2026-04-20 13:26:10'),
(60, 'ค่ายรักน้อง', 17, 2, '20000.00', '20000.00', 'นางรวีวรรณ  โชคชัยชีวากร', 1, '2026-04-20 13:26:10'),
(61, 'กิจกรรมวัดแววความสามารถพิเศษ', 17, 1, '0.00', '0.00', 'นางสาวสุภาพร  ศรีโยธา', 1, '2026-04-20 13:26:10'),
(62, 'ฝึกประสบการณ์อาชีพ นักเรียนชั้นมัธยมศึกษาปีที่ 5', 17, 1, '3000.00', '3000.00', 'นางสาวสุภาพร  ศรีโยธา', 1, '2026-04-20 13:26:10'),
(63, 'จัดหากระดาษและหมึกเพื่อใช้เป็นการผลิตเอกสาร/แบบทดสอบ 1/2569', 18, 1, '480000.00', '480000.00', 'นายพิพัฒณ์พล  เนตรทิพย์', 1, '2026-04-20 13:26:10'),
(64, 'การซ่อมบำรุงเครื่องพิมพ์และอุปกรณ์ส่วนกลาง 1/269', 18, 1, '20000.00', '20000.00', 'นายพิพัฒณ์พล  เนตรทิพย์', 1, '2026-04-20 13:26:10'),
(65, 'จัดหากระดาษและหมึกเพื่อใช้เป็นการผลิตเอกสาร/แบบทดสอบ 2/2569', 18, 1, '280000.00', '280000.00', 'นายพิพัฒณ์พล  เนตรทิพย์', 1, '2026-04-20 13:26:10'),
(66, 'การซ่อมบำรุงเครื่องพิมพ์และอุปกรณ์ส่วนกลาง 2/2569', 18, 1, '20000.00', '20000.00', 'นายพิพัฒณ์พล  เนตรทิพย์', 1, '2026-04-20 13:26:10'),
(67, 'จัดหาวัสดุ/อุปกรณ์ ที่มีมาตรฐานและมีคุณภาพในการรองรับการผลิตแบบทดสอบ 1/2569', 19, 1, '3000.00', '3000.00', 'นายพิพัฒณ์พล  เนตรทิพย์', 1, '2026-04-20 13:26:10'),
(68, 'จััดหาวัสดุ/อุปกรณ์ ที่ใช้ประกอบในการจัดสอบวัดผลกลางภาคและปลายภาค 1/2569', 19, 1, '10000.00', '10000.00', 'นายพิพัฒณ์พล  เนตรทิพย์', 1, '2026-04-20 13:26:10'),
(69, 'จัดหาวัสดุ/อุปกรณ์ ที่มีมาตรฐานและมีคุณภาพในการรองรับการผลิตแบบทดสอบ 2/2569', 19, 1, '2000.00', '2000.00', 'นายพิพัฒณ์พล  เนตรทิพย์', 1, '2026-04-20 13:26:10'),
(70, 'จััดหาวัสดุ/อุปกรณ์ ที่ใช้ประกอบในการจัดสอบวัดผลกลางภาคและปลายภาค 2/2569', 19, 1, '10000.00', '10000.00', 'นายพิพัฒณ์พล  เนตรทิพย์', 1, '2026-04-20 13:26:10'),
(71, 'ส่งเสริม สนับสนุนการจัดการเรียนการสอนการศึกษาค้นคว้า และสร้างองค์ความรู้ (Research &Knowledge Formation) : IS 1/2569', 20, 1, '0.00', '0.00', 'นางวิมลรัตน์  รูปแก้ว', 1, '2026-04-20 13:26:10'),
(72, 'ส่งเสริมสนับสนุนการนำความรู้ไปใช้บริการสังคม (IS3) 1/2569', 20, 1, '1650.00', '1650.00', 'นางวิมลรัตน์  รูปแก้ว', 1, '2026-04-20 13:26:10'),
(73, 'ส่งเสริม สนับสนุนการจัดการเรียนการสอนการศึกษาค้นคว้า และสร้างองค์ความรู้ (Research &Knowledge Formation) : IS 2/2569', 20, 1, '0.00', '0.00', 'นางวิมลรัตน์  รูปแก้ว', 1, '2026-04-20 13:26:10'),
(74, 'ส่งเสริมสนับสนุนการนำความรู้ไปใช้บริการสังคม (IS3) 2/2569', 20, 1, '13350.00', '13350.00', 'นางวิมลรัตน์  รูปแก้ว', 1, '2026-04-20 13:26:10'),
(75, 'การวัดผลประเมินผลและเทียบโอนผลการเรียน 1/2569', 21, 1, '0.00', '0.00', 'นางสิรินารถ  สรรพอาสา', 1, '2026-04-20 13:26:10'),
(76, 'พัฒนาและประเมินการอ่าน คิด วิเคราะห์ และเขียน 1/2569', 21, 1, '0.00', '0.00', 'นางสาวสุพัตตรา  เทียมทัด', 1, '2026-04-20 13:26:10'),
(77, 'การประเมินคุณลักษณะอันพึงประสงค์ 1/2569', 21, 1, '0.00', '0.00', 'นางสาวธารารัตน์  ดวงจันทร์', 1, '2026-04-20 13:26:10'),
(78, 'การประเมินสมรรถนะทางการเรียนของผู้เรียน 1/2569', 21, 1, '0.00', '0.00', 'นางสาวพิมพ์ลภัทร์  สิมานุรักษ์', 1, '2026-04-20 13:26:10'),
(79, 'การทดสอบตามนโยบายสพฐ. 1/2569', 21, 1, '0.00', '0.00', 'นางสาวธารารัตน์  ดวงจันทร์', 1, '2026-04-20 13:26:10'),
(80, 'การวัดผลประเมินผลและเทียบโอนผลการเรียน 2/2569', 21, 1, '14000.00', '14000.00', 'นางสิรินารถ  สรรพอาสา', 1, '2026-04-20 13:26:10'),
(81, 'พัฒนาและประเมินการอ่าน คิด วิเคราะห์ และเขียน 2/2569', 21, 1, '0.00', '0.00', 'นางสาวสุพัตตรา  เทียมทัด', 1, '2026-04-20 13:26:10'),
(82, 'การประเมินคุณลักษณะอันพึงประสงค์ 2/2569', 21, 1, '0.00', '0.00', 'นางสาวธารารัตน์  ดวงจันทร์', 1, '2026-04-20 13:26:10'),
(83, 'การประเมินสมรรถนะทางการเรียนของผู้เรียน 2/2569', 21, 1, '0.00', '0.00', 'นางสาวพิมพ์ลภัทร์  สิมานุรักษ์', 1, '2026-04-20 13:26:10'),
(84, 'การทดสอบตามนโยบายสพฐ. 2/2569', 21, 1, '0.00', '0.00', 'นางสาวธารารัตน์  ดวงจันทร์', 1, '2026-04-20 13:26:10'),
(85, 'การพัฒนาหลักสูตรสถานศึกษา และหลักสูตรกลุ่มสาระการเรียนรู้ 8 กลุ่ม', 22, 1, '2000.00', '2000.00', 'นางสาวศิริมา  จำปารอด', 1, '2026-04-20 13:26:10'),
(86, 'การพัฒนาหลักสูตรท้องถิ่น 1/2569', 22, 1, '600.00', '600.00', 'นางสาวทิพวรรณ  เพชรกันหา', 1, '2026-04-20 13:26:10'),
(87, 'การพัฒนางานตารางสอน 1/2569', 22, 1, '0.00', '0.00', 'นางสาวภัทร์ธีรา  วงษาวดี', 1, '2026-04-20 13:26:10'),
(88, 'การพัฒนาหลักสูตรท้องถิ่น 2/2569', 22, 1, '400.00', '400.00', 'นางสาวทิพวรรณ  เพชรกันหา', 1, '2026-04-20 13:26:10'),
(89, 'การพัฒนางานตารางสอน 2/2569', 22, 1, '0.00', '0.00', 'นางสาวภัทร์ธีรา  วงษาวดี', 1, '2026-04-20 13:26:10'),
(90, 'การขับเคลื่อนชุมชนการเรียนรู้ทางวิชาชีพ (PLC) 1/2569', 23, 1, '7500.00', '7500.00', 'นางปคุณาณัช  ทองแจ่ม', 1, '2026-04-20 13:26:10'),
(91, 'งานวิจัยในชั้นเรียน', 23, 1, '1000.00', '1000.00', 'นางสาวปนัดดา  กองมนต์', 1, '2026-04-20 13:26:10'),
(92, 'การขับเคลื่อนชุมชนการเรียนรู้ทางวิชาชีพ (PLC) 2/2569', 23, 1, '4500.00', '4500.00', 'นางปคุณาณัช  ทองแจ่ม', 1, '2026-04-20 13:26:10'),
(93, 'กิจกรรม PLC ระดับชั้นเรียนจำนวน 6 กลุ่ม ประจำภาคเรียนที่ 2', 23, 1, '3000.00', '3000.00', 'นางปคุณาณัช  ทองแจ่ม', 1, '2026-04-20 13:26:10'),
(94, 'ศึกษาเนื้อหา รวบรวมแหล่งเรียนรู้ อำเภอวิเชียรบุรี', 24, 1, '0.00', '0.00', 'นางสาวทิพวรรณ  เพชรกันหา', 1, '2026-04-20 13:26:10'),
(95, 'อบรม สืบสานวัฒนธรรม\"รำโจ๋ง\"', 24, 1, '13100.00', '13100.00', 'นางสาวทิพวรรณ  เพชรกันหา', 1, '2026-04-20 13:26:10'),
(96, 'ประชุมคณะกรรมการ 1/2569', 25, 1, '0.00', '0.00', 'นางรวีวรรณ  โชคชัยชีวากร', 1, '2026-04-20 13:26:10'),
(97, 'ปฐมนิเทศ 1/2569', 25, 1, '0.00', '0.00', 'นางรวีวรรณ  โชคชัยชีวากร', 1, '2026-04-20 13:26:10'),
(98, 'นิเทศการสอน จัดทำเอกสารประจำตัวของนักศึกษา 1/2569', 25, 1, '0.00', '0.00', 'นางรวีวรรณ  โชคชัยชีวากร', 1, '2026-04-20 13:26:10'),
(99, 'ประเมินผลการปฏิบัติงาน นิสิต นักศึกษา 1/2569', 25, 1, '0.00', '0.00', 'นางรวีวรรณ  โชคชัยชีวากร', 1, '2026-04-20 13:26:10'),
(100, 'มอบเกียรติบัติครูพี่เลี้ยงและนิสิต นักศึกษา 1/2569', 25, 1, '0.00', '0.00', 'นางรวีวรรณ  โชคชัยชีวากร', 1, '2026-04-20 13:26:10'),
(101, 'ประชุมคณะกรรมการ 2/2569', 25, 1, '0.00', '0.00', 'นางรวีวรรณ  โชคชัยชีวากร', 1, '2026-04-20 13:26:10'),
(102, 'ปฐมนิเทศ 2/2569', 25, 1, '0.00', '0.00', 'นางรวีวรรณ  โชคชัยชีวากร', 1, '2026-04-20 13:26:10'),
(103, 'นิเทศการสอน จัดทำเอกสารประจำตัวของนักศึกษา 2/2569', 25, 1, '0.00', '0.00', 'นางรวีวรรณ  โชคชัยชีวากร', 1, '2026-04-20 13:26:10'),
(104, 'ประเมินผลการปฏิบัติงาน นิสิต นักศึกษา 2/2569', 25, 1, '0.00', '0.00', 'นางรวีวรรณ  โชคชัยชีวากร', 1, '2026-04-20 13:26:10'),
(105, 'มอบเกียรติบัติครูพี่เลี้ยงและนิสิต นักศึกษา 2/2569', 25, 1, '0.00', '0.00', 'นางรวีวรรณ  โชคชัยชีวากร', 1, '2026-04-20 13:26:10'),
(106, 'พัฒนาศักยภาพทางด้านศิลปะ ดนตรีไทย ดนตรีสากล และนาฏศิลป์', 26, 1, '60000.00', '60000.00', 'นายสมาน  ทวีผล', 1, '2026-04-20 13:26:10'),
(107, 'พัฒนาศักยภาพการจัดกิจกรรมด้านดนตรี', 26, 1, '7000.00', '7000.00', 'นายปริญญา  ดีนอก', 1, '2026-04-20 13:26:10'),
(108, 'วันสุนทรภู่สู่วันภาษาไทยแห่งชาติ', 27, 1, '40000.00', '40000.00', 'นางสาวณัฐมล  ภู่สิงห์', 1, '2026-04-20 13:26:10'),
(109, 'Thai Next GEN', 27, 1, '40000.00', '40000.00', 'นางรวีวรรณ  โชคชัยชีวากร', 1, '2026-04-20 13:26:10'),
(110, 'จัดซื้อ จัดหา ครุภัณฑ์กลุ่มสาระการเรียนรู้ภาษาต่างประเทศ', 28, 1, '2560.00', '2560.00', 'นางสมฤดี  สุทธหลวง', 1, '2026-04-20 13:26:10'),
(111, 'กิจกรรมอบรม CEFR ', 28, 1, '28440.00', '28440.00', 'นายสุรวิชญ์  ชิตทอง', 1, '2026-04-20 13:26:10'),
(112, 'English camp', 28, 1, '49000.00', '49000.00', 'นางปาลิกา  ทัตเศษ', 1, '2026-04-20 13:26:10'),
(113, 'การพัฒนากระบวนการจัดการเรียนรู้เพื่อมุ่งพัฒนาผลสัมฤทธิ์ 1/2569', 29, 1, '0.00', '0.00', 'นางสาวกัญญาณัฐ  คำยัง', 1, '2026-04-20 13:26:10'),
(114, 'กิจกรรมค่ายศิลป์ - สังคม', 29, 1, '19900.00', '19900.00', 'นางสาวกัญญาณัฐ  คำยัง', 1, '2026-04-20 13:26:10'),
(115, 'นักคิดพิชิตกฏหมาย', 29, 1, '4500.00', '4500.00', 'นางสาวสุมาลี  คำสว่าง', 1, '2026-04-20 13:26:10'),
(116, 'วิถีไทยวิถีพุทธ 1/2569', 29, 1, '0.00', '0.00', 'นายสุรัตน์  แซงศรีนวล', 1, '2026-04-20 13:26:10'),
(117, 'การจัดซื้อและซ่อมแซมวัสดุ อุปกรณ์ ครุภัณฑ์กลุ่มสาระการเรียนรู้สังคมศึกษา ศาสนาและวัฒนธรรม 1/2569', 29, 1, '0.00', '0.00', 'นางสาวกัญญาณัฐ  คำยัง', 1, '2026-04-20 13:26:10'),
(118, 'การพัฒนากระบวนการจัดการเรียนรู้เพื่อมุ่งพัฒนาผลสัมฤทธิ์ 2/2569', 29, 1, '0.00', '0.00', 'นางสาวกัญญาณัฐ  คำยัง', 1, '2026-04-20 13:26:10'),
(119, 'Act Smartมารยาทไทยในชีวิตจริง', 29, 1, '7800.00', '7800.00', 'นางสาวสุธิตา  รัตนทอง', 1, '2026-04-20 13:26:10'),
(120, 'ท้าประลองสังคมศึกษา', 29, 1, '7800.00', '7800.00', 'นางสาวมัทณา  หนูขาว', 1, '2026-04-20 13:26:10'),
(121, 'การสอบธรรมศึกษาและมอบเกียรติบัตร', 29, 1, '0.00', '0.00', '', 1, '2026-04-20 13:26:10'),
(122, 'วิถีไทยวิถีพุทธ 2/2569', 29, 1, '0.00', '0.00', 'นายสุรัตน์  แซงศรีนวล', 1, '2026-04-20 13:26:10'),
(123, 'การแข่งขันทางวิชาการ ภายนอกสถานศึกษา', 29, 1, '0.00', '0.00', 'นางสาวกัญญาณัฐ  คำยัง', 1, '2026-04-20 13:26:10'),
(124, 'การจัดซื้อและซ่อมแซมวัสดุ อุปกรณ์ ครุภัณฑ์กลุ่มสาระการเรียนรู้สังคมศึกษา ศาสนาและวัฒนธรรม 2/2569', 29, 1, '0.00', '0.00', 'นางสาวกัญญาณัฐ  คำยัง', 1, '2026-04-20 13:26:10'),
(125, 'สรุปงาน/กิจกรรม/โครงการ', 29, 1, '0.00', '0.00', 'นางสาวกัญญาณัฐ  คำยัง', 1, '2026-04-20 13:26:10'),
(126, 'การสอนงานช่างอุตสาหกรรม', 30, 1, '25000.00', '25000.00', 'นางสาวอภิญญา  สัมฤทธิ์', 1, '2026-04-20 13:26:10'),
(127, 'การเรียนการสอนงานคหกรรมและงานธุรกิจ', 30, 1, '69000.00', '69000.00', 'นางศิรประภา  สุระมาตย์', 1, '2026-04-20 13:26:10'),
(128, 'การเรียนการสอนกิจกรรมชุมนุมกล่อมวิถี', 30, 1, '12000.00', '12000.00', 'นางสาวภรฤดี  ผินสันเทียะ', 1, '2026-04-20 13:26:10'),
(129, 'การสอนงานช่างอุตสาหกรรม 2/2569', 30, 1, '25000.00', '25000.00', 'นางสาวอภิญญา  สัมฤทธิ์', 1, '2026-04-20 13:26:10'),
(130, 'การเรียนการสอนงานคหกรรมและงานธุรกิจ 2/2569', 30, 1, '5000.00', '5000.00', 'นางศิรประภา  สุระมาตย์', 1, '2026-04-20 13:26:10'),
(131, 'การเรียนการสอนกิจกรรมชุมนุมกล่อมวิถี 2/2569', 30, 1, '7000.00', '7000.00', 'นางสาวภรฤดี  ผินสันเทียะ', 1, '2026-04-20 13:26:10'),
(132, 'การจัดการเรียนการสอนวิทยาศาสตร์ และเทคโนโลยี', 31, 1, '0.00', '0.00', 'นางสาวทิพธิพร  ห่วงยา', 1, '2026-04-20 13:26:10'),
(133, 'คัดเลือกหนังสือเรียนกลุ่มสาระการเรียนรู้วิทยาศาสตร์ และเทคโนโลยี', 31, 1, '0.00', '0.00', 'นางสาวทิพธิพร  ห่วงยา', 1, '2026-04-20 13:26:10'),
(134, 'พัฒนากระบวนการเรียนรู้ของกลุ่มสาระการเรียนรู้วิทยาศาสตร์ และเทคโนโลยี', 31, 1, '0.00', '0.00', 'นางสาวทิพธิพร  ห่วงยา', 1, '2026-04-20 13:26:10'),
(135, 'นิเทศการสอนขอวครูกลุ่มสาระการเรียนรู้วิทยาศาสตร์ และเทคโนโลยี', 31, 1, '0.00', '0.00', 'นางสาวทิพธิพร  ห่วงยา', 1, '2026-04-20 13:26:10'),
(136, 'การจัดซื้อและซ่อมแซมวัสดุ อุปกรณ์ ครุภัณฑ์กกลุ่มสาระการเรียนรู้วิทยาศาสตร์ และเทคโนโลยี', 31, 1, '216000.00', '216000.00', 'นางสาวทิพธิพร  ห่วงยา', 1, '2026-04-20 13:26:10'),
(137, 'พัฒนาผลสัมฤทธิ์ทางการเรียนของกลุ่มสาระการเรียนรู้วิทยาศาสตร์ และเทคโนโลยี', 31, 1, '0.00', '0.00', 'นางสาวทิพธิพร  ห่วงยา', 1, '2026-04-20 13:26:10'),
(138, 'สัปดาห์วิทยาศาสตร์ - คณิตศาสตร์ภายในโรงเรียน', 31, 1, '28500.00', '28500.00', 'นางสาวทิพธิพร  ห่วงยา', 1, '2026-04-20 13:26:10'),
(139, 'กิจกรรมเกี่ยวกับวิทยาศาสตร์และเทคโนโลยีในโรงเรียนร่วมกับฝ่ายบริหารวิชาการ', 31, 1, '0.00', '0.00', 'นางสาวทิพธิพร  ห่วงยา', 1, '2026-04-20 13:26:10'),
(140, 'พัฒนาและส่งเสริมนักเรียนให้มีทักษะการเรียนวิชาวิทยาศาสตร์และเทคโนโลยีโดยเข้าร่วมกิจกรรมการแข่งขันทักษะทางวิทยาศาสตร์และเทคโนโลยีภายนอกโรงเรียน', 31, 1, '0.00', '0.00', 'นางสาวทิพธิพร  ห่วงยา', 1, '2026-04-20 13:26:10'),
(141, 'ของที่ระลึก ม.1 เข้าศึกษาศูนย์อุตุนิยมวิทยาวิเชียรบุรี', 31, 1, '500.00', '500.00', 'นางสุกัญญา จุมพรม', 1, '2026-04-20 13:26:10'),
(142, 'สรุปงาน/กิจกรรม', 31, 1, '0.00', '0.00', 'นางสาวทิพธิพร  ห่วงยา', 1, '2026-04-20 13:26:10'),
(143, 'พัฒนากระบวนการจัดการเรียนรู้ของครูกลุ่มสาระการเรียนรู้คณิตศาสตร์', 32, 1, '4150.00', '4150.00', 'นางสาวอภิญญา  สัมฤทธิ์', 1, '2026-04-20 13:26:10'),
(144, 'พัฒนาศักยภาพนักเรียนแกนนำโครงการโรงเรียนนำร่อง DSP', 32, 1, '57850.00', '57850.00', 'นางศิรประภา  สุระมาตย์', 1, '2026-04-20 13:26:10'),
(145, 'การจัดซื้อและซ่อมแซม วัสดุ/อุปกรณ์/ครุภัณฑ์กลุ่มสาระการเรียนรู้คณิตศาสตร์', 32, 1, '0.00', '0.00', 'นางสาวภรฤดี  ผินสันเทียะ', 1, '2026-04-20 13:26:11'),
(146, 'ส่งเสริมศักยภาพทางคณิตศาสตร์นักเรียนในสถานศึกษา', 32, 1, '11900.00', '11900.00', 'นางสาวอภิญญา  สัมฤทธิ์', 1, '2026-04-20 13:26:11'),
(147, 'ส่งเสริมศักยภาพทางคณิตศาสตร์นักเรียนนอกสถานศึกษา', 32, 1, '6100.00', '6100.00', 'นางศิรประภา  สุระมาตย์', 1, '2026-04-20 13:26:11'),
(148, 'พัฒนาการจัดการเรียนการสอนกลุ่มสาระการเรียนรู้สุขศึกษาและพลศึกษา', 33, 1, '75000.00', '75000.00', 'นายสมชาย เที่ยงดี', 1, '2026-04-20 13:26:11'),
(149, 'พัฒนาการจัดการเรียนการสอนกลุ่มสาระการเรียนรู้สุขศึกษาและพลศึกษา', 33, 1, '20000.00', '20000.00', 'นายสมชาย เที่ยงดี', 1, '2026-04-20 13:26:11'),
(150, 'กีฬาภายใน \"ร่มโพธิเกม\"', 33, 2, '80000.00', '80000.00', 'นายสมชาย เที่ยงดี', 1, '2026-04-20 13:26:11'),
(151, 'พัฒนาความเป็นเลิศทางวิชาการสู่โอลิมปิก (ติวข้อสอบ)', 34, 2, '14400.00', '14400.00', 'นางนิลุบล  สำเภา', 1, '2026-04-20 13:26:11'),
(152, 'สนับสนุนรางวัลนักเรียนโอลิมปิกวิชาการ', 34, 2, '10100.00', '10100.00', 'นางนิลุบล  สำเภา', 1, '2026-04-20 13:26:11'),
(153, 'ปรับพื้นฐานนักเรียนชั้นมัธยมศึกษาปีที่ 1 และ 4', 35, 2, '20000.00', '20000.00', 'นายโสภณ  ท้วมโชติ', 1, '2026-04-20 13:26:11'),
(154, 'ปฐมนิเทศ', 35, 2, '30000.00', '30000.00', 'นายโสภณ  ท้วมโชติ', 1, '2026-04-20 13:26:11'),
(155, 'ปัจฉิมนิเทศ', 35, 2, '25000.00', '25000.00', 'นายโสภณ  ท้วมโชติ', 1, '2026-04-20 13:26:11'),
(156, 'ค่ายส่งเสริมศักยภาพนักเรียนห้องเรียนศิลป์คำนวณ', 36, 2, '32000.00', '32000.00', 'นายกฤษฎิ์ไกรวิชญ์  จันทรัตน์', 1, '2026-04-20 13:26:11'),
(157, 'ตลาดนัดศิลป์-คำนวณ', 36, 2, '2000.00', '2000.00', 'นางศิรประภา  สุระมาตย์', 1, '2026-04-20 13:26:11'),
(158, 'สมัครสอบโครงการ', 37, 2, '0.00', '0.00', 'นางสาววรรณิษา  สีโถ', 1, '2026-04-20 13:26:11'),
(159, 'ติวการแก้โจทย์ปัญหาวิชาคณิตศาสตร์ และวิทยาศาสตร์', 37, 2, '27200.00', '27200.00', 'นางสาววรรณิษา  สีโถ', 1, '2026-04-20 13:26:11'),
(160, 'มอบรางวัล', 37, 2, '2800.00', '2800.00', 'นางสาววรรณิษา  สีโถ', 1, '2026-04-20 13:26:11'),
(161, 'จัดนิทรรศการและพิธีเปิด', 38, 2, '100000.00', '100000.00', 'นางอรอุมา  ลักษณะทอง', 1, '2026-04-20 13:26:11'),
(162, 'พัฒนาระบบการบริหารจัดการ/ผู้นำทางวิชาการวิทยาศาสตร์ คณิตศาสตร์ และเทคโนโลยี 1/2569', 39, 1, '0.00', '0.00', 'นางสาวธารารัตน์  ดวงจันทร์', 1, '2026-04-20 13:26:11'),
(163, 'พัฒนาครูในโครงการโรงเรียนคุณภาพ SMT สสวท. 1/2569', 39, 1, '0.00', '0.00', 'นางสาวธารารัตน์  ดวงจันทร์', 1, '2026-04-20 13:26:11'),
(164, 'ค่ายพัฒนาทักษะการเรียนรู้ทางวิทยาศาสตร์ คณิตศาสตร์ และเทคโนโลยี (อุดหรุนรายหัว)', 39, 1, '2400.00', '2400.00', 'นางสาวธารารัตน์  ดวงจันทร์', 1, '2026-04-20 13:26:11'),
(165, 'ค่ายพัฒนาทักษะการเรียนรู้ทางวิทยาศาสตร์ คณิตศาสตร์ และเทคโนโลยี (กิจกรรมพัฒนาคุณภาพผู้เรียน)', 39, 2, '33500.00', '33500.00', 'นางสาวธารารัตน์  ดวงจันทร์', 1, '2026-04-20 13:26:11'),
(166, 'พัฒนาระบบการบริหารจัดการ/ผู้นำทางวิชาการวิทยาศาสตร์ คณิตศาสตร์ และเทคโนโลยี 2/2569', 39, 1, '0.00', '0.00', 'นางสาวธารารัตน์  ดวงจันทร์', 1, '2026-04-20 13:26:11'),
(167, 'พัฒนาครูในโครงการโรงเรียนคุณภาพ SMT สสวท. 2/2569', 39, 1, '0.00', '0.00', 'นางสาวธารารัตน์  ดวงจันทร์', 1, '2026-04-20 13:26:11'),
(168, 'จัดซื้อวัสดุอุปกรณ์และครุภัณฑ์งานโรงเรียนคุณภาพ SMT สสวท.', 39, 2, '3900.00', '3900.00', 'นางสาวธารารัตน์  ดวงจันทร์', 1, '2026-04-20 13:26:11'),
(169, 'ส่งเสริมความเป็นเลิศด้านวิชาการ 1/2569 (อุดหรุนรายหัว)', 40, 1, '32860.00', '32860.00', 'นางอรอุมา  ลักษณะทอง', 1, '2026-04-20 13:26:11'),
(170, 'ส่งเสริมความเป็นเลิศด้านวิชาการ 1/2569 (กิจกรรมพัฒนาคุณภาพผู้เรียน)', 40, 2, '47140.00', '47140.00', 'นางอรอุมา  ลักษณะทอง', 1, '2026-04-20 13:26:11'),
(171, 'ส่งเสริมความเป็นเลิศด้านวิชาการ 2/2569', 40, 1, '120000.00', '120000.00', 'นางอรอุมา  ลักษณะทอง', 1, '2026-04-20 13:26:11'),
(172, 'ส่งเสริมความเป็นเลิศด้านกีฬา 1/2569', 41, 2, '139000.00', '139000.00', 'นายสมชาย เที่ยงดี', 1, '2026-04-20 13:26:11'),
(173, 'ส่งเสริมความเป็นเลิศด้านกีฬา 2/2569', 41, 2, '61000.00', '61000.00', 'นายสมชาย เที่ยงดี', 1, '2026-04-20 13:26:11'),
(174, 'เดินทางไกลและอยู่ค่ายพักแรม ลูกเสือเนตรนารีระดับชั้น ม.1', 42, 2, '51640.00', '51640.00', 'นางสาวศิริมา  จำปารอด', 1, '2026-04-20 13:26:11'),
(175, 'เดินทางไกลและอยู่ค่ายพักแรม ลูกเสือเนตรนารีระดับชั้น ม.2', 42, 2, '76785.00', '76785.00', 'นายกฤษฎิ์ไกรวิชญ์  จันทรัตน์', 1, '2026-04-20 13:26:11'),
(176, 'เดินทางไกลและอยู่ค่ายพักแรม ลูกเสือเนตรนารีระดับชั้น ม.3 (อุดหรุนรายหัว)', 42, 1, '25000.00', '25000.00', 'นายทวีศักดิ์  สินทรัพย์', 1, '2026-04-20 13:26:11'),
(177, 'เดินทางไกลและอยู่ค่ายพักแรม ลูกเสือเนตรนารีระดับชั้น ม.3 (กิจกรรมพัฒนาคุณภาพผู้เรียน)', 42, 2, '100175.00', '100175.00', 'นายทวีศักดิ์  สินทรัพย์', 1, '2026-04-20 13:26:11'),
(178, 'อยู่ค่ายพักแรมยุวกาชาด', 42, 2, '60000.00', '60000.00', 'นางสาวสุมลรัตน์  ต่ายตระเวน', 1, '2026-04-20 13:26:11'),
(179, 'การแสดงละครประวัติศาสตร์ และสืบสานวัฒนธรรมท้องถิ่น', 43, 2, '17600.00', '17600.00', 'นางสาวทิพวรรณ  เพชรกันหา', 1, '2026-04-20 13:26:11'),
(180, 'จัดการแสดง/เข้าร่วมขบวนเทิดพระเกียรติองสมเด็จพระนเรศวรมหาราช', 43, 2, '52400.00', '52400.00', 'นายกฤษฎิ์ไกรวิชญ์  จันทรัตน์', 1, '2026-04-20 13:26:11'),
(181, 'ส่งเสริมและพัฒนาการบริหารงานวิชาการตามนโยบายและจุดเน้น มุ่งสู่ความเป็นเลิศ 1/2569', 44, 1, '131200.00', '131200.00', 'นางเพลิน  แก้วสุข', 1, '2026-04-20 13:26:11'),
(182, 'ส่งเสริมและพัฒนาการบริหารงานวิชาการตามนโยบายและจุดเน้น มุ่งสู่ความเป็นเลิศ 2/2569', 44, 1, '131200.00', '131200.00', 'นางเพลิน  แก้วสุข', 1, '2026-04-20 13:26:11'),
(183, 'จัดซื้อหนังสือเรียนระดับชั้นมัธยมศึกษาปีที่ 1 - 6 ปีการศึกษา 2569 โรงเรียนนิยมศิลป์อนุสรณ์	', 45, 1, '0.00', '0.00', 'นางอรอุมา  ลักษณะทอง', 1, '2026-04-20 13:26:11'),
(184, 'เตรียมรับการนิเทศกำกับติดตาม 1/2569', 46, 1, '0.00', '0.00', 'นางอรอุมา  ลักษณะทอง', 1, '2026-04-20 13:26:11'),
(185, 'เตรียมรับการนิเทศกำกับติดตาม 2/2569', 46, 1, '0.00', '0.00', 'นางอรอุมา  ลักษณะทอง', 1, '2026-04-20 13:26:11'),
(186, 'การพัฒนาการบริหารสำนักงานกลุ่มบริหารงานบุคคล 1/2569', 47, 1, '51620.00', '51620.00', 'นางสาวณัฐมล  ภู่สิงห์', 1, '2026-04-20 13:26:11'),
(187, 'การพัฒนาการบริหารสำนักงานกลุ่มบริหารงานบุคคล 2/2569', 47, 1, '30924.00', '30924.00', 'นางสาวณัฐมล  ภู่สิงห์', 1, '2026-04-20 13:26:11'),
(188, 'การอบรมเชิงปฏิบัติการ\"การดูแลช่วยเหลือนักเรียนในที่ปนึกษาด้วยระบบสารสนเทศ HERO Obec Care ปีการศึกษา2569\"', 48, 1, '2940.00', '2940.00', 'นางสาวกนกธรณ์  สร้อยโต', 1, '2026-04-20 13:26:11'),
(189, 'การอบรมเชิงปฏิบัติการ\"การเขียนแผนการจัดการเรียนรู้ตาม 8 ตัวชี้วัด\"', 48, 1, '18160.00', '18160.00', 'นางปคุณาณัช  ทองแจ่ม', 1, '2026-04-20 13:26:11'),
(190, 'การอบรมเชิงปฏิบัติการ\"การเขียนแผนการจัดการเรียนรู้บูรณาการหลักปรัชญาของเศรษฐกิจพอเพียง\"', 48, 1, '17360.00', '17360.00', 'นายสุรัตน์  แซงศรีนงล', 1, '2026-04-20 13:26:11'),
(191, 'การอบรมเชิงปฏิบัติการ \"แพลตฟอร์มดิจิทัล NDLP\"', 48, 1, '11760.00', '11760.00', 'นางสาวบุษรินทร์  ตะกรุดแก้ว', 1, '2026-04-20 13:26:11'),
(192, 'การอบรมเชิงปฏิบัติการ \"การเขียนโครงกาตามแผนปฏิบัติการประจำปีการศึกษา 2570\"', 48, 1, '12260.00', '12260.00', 'นายกฤษฎิ์ไกรวิชญ์  จันทรัตน์', 1, '2026-04-20 13:26:11'),
(193, 'การอบรมเชิงปฏิบัติการ \"ระเบียบการเงิน พัสดุ\"', 48, 1, '18960.00', '18960.00', 'นายกฤษฎิ์ไกรวิชญ์  จันทรัตน์', 1, '2026-04-20 13:26:11'),
(194, 'การอบรมเชิงปฏิบัติการ \"การพัฒนาผลงานทางวิชาการสู่ความก้าวหน้าทางวิชาชีพตามหลักเกณฑ์ ว9/2564 และว10/2567\"', 48, 1, '18560.00', '18560.00', 'นางนิลุบล  สำเภา', 1, '2026-04-20 13:26:11'),
(195, 'จัดซื้อวัสดุครุภัณฑ์ห้องสำนักงานกลุ่มบริหารงบประมาณ', 49, 1, '150426.00', '150426.00', 'นางสาวสมรัศมิ์  สายทอง', 1, '2026-04-20 13:26:11'),
(196, 'ซ่อมบำรุง วัสดุ ครุภัณฑ์ห้องสำนักงานกลุ่มบริหารงบประมาณ', 49, 1, '5000.00', '5000.00', 'นางสาวสมรัศมิ์  สายทอง', 1, '2026-04-20 13:26:11'),
(197, 'จัดซื้อวัสดุครุภัณฑ์ห้องสำนักงานกลุ่มบริหารงบประมาณ', 49, 1, '5118.00', '5118.00', 'นางสาวสมรัศมิ์  สายทอง', 1, '2026-04-20 13:26:11'),
(198, 'ซ่อมบำรุง วัสดุ ครุภัณฑ์ห้องสำนักงานกลุ่มบริหารงบประมาณ', 49, 1, '10000.00', '10000.00', 'นางสาวสมรัศมิ์  สายทอง', 1, '2026-04-20 13:26:11'),
(199, 'จ่ายเงินปัจจัยพื้นฐานนักเรียนยากจน 1/2569', 50, 4, '0.00', '0.00', 'นางสาววรรณิษา สีโถ', 1, '2026-04-20 13:26:11'),
(200, 'จ่ายเงินปัจจัยพื้นฐานนักเรียนยากจนพิเศษ 1/2569', 50, 4, '0.00', '0.00', 'นางสาววรรณิษา สีโถ', 1, '2026-04-20 13:26:11'),
(201, 'จ่ายเงินปัจจัยพื้นฐานนักเรียนยากจน 2/2569', 50, 4, '0.00', '0.00', 'นางสาววรรณิษา สีโถ', 1, '2026-04-20 13:26:11'),
(202, 'จ่ายเงินปัจจัยพื้นฐานนักเรียนยากจนพิเศษ /2569', 50, 4, '0.00', '0.00', 'นางสาววรรณิษา สีโถ', 1, '2026-04-20 13:26:11'),
(203, 'โปรแกรมงานการเงิน', 51, 1, '5000.00', '5000.00', 'นางสาวจารุวรรณ  พุกภัย', 1, '2026-04-20 13:26:11'),
(204, 'โปรแกรมงานพัสดุ', 51, 1, '6000.00', '6000.00', 'นางสาวมัทนา  หนูขาว', 1, '2026-04-20 13:26:11'),
(205, 'โปรแกรม ZipGrade', 51, 1, '500.00', '500.00', 'นางสาวสิรินาถ  สรรพอาสา', 1, '2026-04-20 13:26:11'),
(206, 'สรุปผลการดำเนินงาน', 51, 1, '500.00', '500.00', 'นางสาวมัทณา  หนูขาว', 1, '2026-04-20 13:26:11'),
(207, 'จ่ายเงินอุดหนุนค่าอุปกรณ์การเรียนตามสิทธินักเรียน 1/2569', 52, 4, '502320.00', '502320.00', 'นางสาวสุธิตา  รัตนทอง', 1, '2026-04-20 13:26:11'),
(208, 'จ่ายเงินอุดหนุนค่าเครื่องแบบนักเรียนตามสิทธินักเรียน ', 52, 4, '1014500.00', '1014500.00', 'นางสาวชรินทร์ทิพย์  ซ่งสกุลชัย', 1, '2026-04-20 13:26:11'),
(209, 'จ่ายเงินอุดหนุนค่าอุปกรณ์การเรียนตามสิทธินักเรียน 2/2569', 52, 4, '502320.00', '502320.00', 'นางสาวสุธิตา  รัตนทอง', 1, '2026-04-20 13:26:11'),
(210, 'ค่าบริการสัญญาณอินเทอร์เน็ต', 53, 2, '73000.00', '73000.00', 'นางสาววรกานต์  สุดาจันทร์', 1, '2026-04-20 13:26:11'),
(211, 'ค่าบริการสัญญาณอินเทอร์เน็ต', 53, 2, '73000.00', '73000.00', 'นางสาววรกานต์  สุดาจันทร์', 1, '2026-04-20 13:26:11'),
(212, 'พัฒนาสำนักงานกลุ่มบริหารทั่วไป 1/2569', 54, 1, '7144.00', '7144.00', 'นางสาวภัคธีมา  แก้วยม', 1, '2026-04-20 13:26:11'),
(213, 'ส่งเสริมการออมเพื่ออนาคต 1/2569', 54, 1, '3000.00', '3000.00', 'นางสาวทิพวรรณ  เพชรกันหา', 1, '2026-04-20 13:26:11'),
(214, 'สนับสนุนเพื่อประโยชน์นักเรียน 1/2569', 54, 1, '0.00', '0.00', 'นางสาวทิพวรรณ  เพชรกันหา', 1, '2026-04-20 13:26:11'),
(215, 'ส่งเสริมเวรประจำวัน 1/2569', 54, 1, '0.00', '0.00', 'นางประภาพรรณ  ชอดริ', 1, '2026-04-20 13:26:11'),
(216, 'โรงเรียนสุจริต 1/2569', 54, 1, '0.00', '0.00', 'นางสาวทิพวรรณ  เพชรกันหา', 1, '2026-04-20 13:26:11'),
(217, 'ประเมินความโปร่งใส ITA 1/2569', 54, 1, '0.00', '0.00', 'นางสาวทิพวรรณ  เพชรกันหา', 1, '2026-04-20 13:26:11'),
(218, 'พัฒนาสำนักงานธุรการ 1/2569', 54, 1, '12320.00', '12320.00', 'นางอภิญญา  พรมรักษา', 1, '2026-04-20 13:26:11'),
(219, 'ตรวจสอบ ซ่อมบำรุง และปรับปรุงระบบไฟฟ้าส่วนกลางภายในสถานศึกษา 1/2569', 55, 1, '90000.00', '90000.00', 'นางสาวปิยาภรณ์  สีหาปัญญา', 1, '2026-04-20 13:26:11'),
(220, 'ตรวจสอบ ซ่อมบำรุง และพัฒนาอุปกรณ์เทคโนโลยี เพื่อการจัดการเรียนรู้ 1/2569', 55, 1, '90000.00', '90000.00', 'นางสาวปิยาภรณ์  สีหาปัญญา', 1, '2026-04-20 13:26:11'),
(221, 'ตรวจสอบ ซ่อมบำรุง และปรับปรุงระบบไฟฟ้าส่วนกลางภายในสถานศึกษา 2/2569', 55, 1, '50000.00', '50000.00', 'นางสาวปิยาภรณ์  สีหาปัญญา', 1, '2026-04-20 13:26:11'),
(222, 'ตรวจสอบ ซ่อมบำรุง และพัฒนาอุปกรณ์เทคโนโลยี เพื่อการจัดการเรียนรู้ 2/2569', 55, 1, '50000.00', '50000.00', 'นางสาวปิยาภรณ์  สีหาปัญญา', 1, '2026-04-20 13:26:11'),
(223, 'จัดซื้อ และซ่อมบำรุงอุปกรณ์เสริมสำหรับงานถ่ายภาพและวิดีโอ', 56, 1, '16000.00', '16000.00', 'นายชัชวานนท์  สงคราม', 1, '2026-04-20 13:26:11'),
(224, 'พัฒนานักเรียนแกนนำโรงเรียนปลอดขยะ', 57, 2, '8000.00', '8000.00', 'นางสาวกานต์รวี  สารไชย', 1, '2026-04-20 13:26:11'),
(225, 'พัฒนาสวนสวยโรงเรียนงาม 1/2569', 58, 1, '7000.00', '7000.00', 'นางสาวภัรฤดี  ผินสันเทียะ', 1, '2026-04-20 13:26:11'),
(226, 'พัฒนาประปาโรงเรียน 1/2569', 58, 1, '15000.00', '15000.00', 'นายพิพัฒณ์พล  เนตรทิพย์', 1, '2026-04-20 13:26:11'),
(227, 'ส่งเสริมกำกับดูแลการใช้งานอาคารเรียน และอาคารประกอบ 1/2569', 58, 1, '200000.00', '200000.00', 'นายมาโนช  ทัตเศษ', 1, '2026-04-20 13:26:11'),
(228, 'ส่งเสริมตกแต่งและประดับผ้าในกิจกรรมสำคัญต่างๆ', 58, 1, '40000.00', '40000.00', 'นางสาวศิริมา  จำปารอด', 1, '2026-04-20 13:26:11'),
(229, 'พัฒนาโรงเรียนปลอดขยะ (Zero waste School)', 58, 1, '20000.00', '20000.00', 'นางสาวกานต์รวี  สารไชย', 1, '2026-04-20 13:26:11'),
(230, 'พัฒนาระบบรางระบายน้ำ', 58, 1, '50000.00', '50000.00', 'นางวิมลรัตน์  รูปแก้ว', 1, '2026-04-20 13:26:11'),
(231, 'พัฒนาระบบรักษาความปลอดภัยในสถานศึกษา', 58, 1, '20000.00', '20000.00', 'นายพรเทพ  พาณิชย์กุล', 1, '2026-04-20 13:26:11'),
(232, 'พัฒนาปรับภูมิทัศน์สุขาโรงเรียน', 58, 1, '30000.00', '30000.00', 'นายทวีศักดิ์  สินทรัพย์', 1, '2026-04-20 13:26:11'),
(233, 'พัฒนาสวนสวยโรงเรียนงาม 2/2569', 58, 1, '3000.00', '3000.00', 'นางสาวภัรฤดี  ผินสันเทียะ', 1, '2026-04-20 13:26:11'),
(234, 'พัฒนาประปาโรงเรียน 2/2569', 58, 1, '15000.00', '15000.00', 'นายพิพัฒณ์พล  เนตรทิพย์', 1, '2026-04-20 13:26:11'),
(235, 'ส่งเสริมกำกับดูแลการใช้งานอาคารเรียน และอาคารประกอบ 2/2569', 58, 1, '100000.00', '100000.00', 'นายมาโนช  ทัตเศษ', 1, '2026-04-20 13:26:11'),
(236, 'จัดชุดของเยี่ยม/ของขวัญ1/2569', 59, 1, '0.00', '0.00', 'นางอนงค์นาฏ  พรมดี', 1, '2026-04-20 13:26:11'),
(237, 'ประสานงานโรงเรียนกับชุมชนด้านประเพณีวัฒนธรรม 1/2569', 59, 1, '0.00', '0.00', 'นางรวีวรรณ  โชคชัยชีวากร', 1, '2026-04-20 13:26:11'),
(238, 'ประสานกับครูที่ปรึกษาเพื่อร่วมเป็นเจ้าภาพฯ กรณีผู้ปกครองหรือนักเรียนเสียชีวิต 1/2569', 59, 1, '0.00', '0.00', 'นางสาวภัคธีมา  แก้วยม', 1, '2026-04-20 13:26:11'),
(239, 'จัดชุดของเยี่ยม/ของขวัญ 2/2569', 59, 1, '0.00', '0.00', 'นางอนงค์นาฏ  พรมดี', 1, '2026-04-20 13:26:11'),
(240, 'ประสานงานโรงเรียนกับชุมชนด้านประเพณีวัฒนธรรม 2/2569', 59, 1, '0.00', '0.00', 'นางรวีวรรณ  โชคชัยชีวากร', 1, '2026-04-20 13:26:11'),
(241, 'ประสานกับครูที่ปรึกษาเพื่อร่วมเป็นเจ้าภาพฯ กรณีผู้ปกครองหรือนักเรียนเสียชีวิต 2/2569', 59, 1, '0.00', '0.00', 'นางสาวภัคธีมา  แก้วยม', 1, '2026-04-20 13:26:11'),
(242, 'ประเพณีวันสงกรานต์ในสถานศึกษา', 59, 1, '0.00', '0.00', 'นางสาวพรนภา  พาสุวรรณ', 1, '2026-04-20 13:26:11'),
(243, 'การสรุปโครงการโรงเรียนกับชุมชน', 59, 1, '0.00', '0.00', 'นางรวีวรรณ  โชคชัยชีวากร', 1, '2026-04-20 13:26:11'),
(244, 'ทัศนศึกษาแหล่งเรียนรู้นักเรียนชั้นมัธยมศึกษาปีที่ 1', 60, 2, '134750.00', '134750.00', 'นางสาวสุปราณี  สุนทรสุริยวงศ์', 1, '2026-04-20 13:26:11'),
(245, 'ทัศนศึกษาแหล่งเรียนรู้นักเรียนชั้นมัธยมศึกษาปีที่ 2', 60, 2, '121660.00', '121660.00', 'นางสาวกานต์รวี  สารไชย', 1, '2026-04-20 13:26:11'),
(246, 'ทัศนศึกษาแหล่งเรียนรู้นักเรียนชั้นมัธยมศึกษาปีที่ 3', 60, 2, '113960.00', '113960.00', 'นางรวีวรรณ  โชคชัยชีวากร', 1, '2026-04-20 13:26:11'),
(247, 'ทัศนศึกษาแหล่งเรียนรู้นักเรียนชั้นมัธยมศึกษาปีที่ 4', 60, 2, '134750.00', '134750.00', 'นายทวีศักดิ์  สินทรัพย์', 1, '2026-04-20 13:26:11'),
(248, 'ทัศนศึกษาแหล่งเรียนรู้นักเรียนชั้นมัธยมศึกษาปีที่ 5', 60, 2, '122045.00', '122045.00', 'นางสาวปภัทรภรณ์  ถาวรกูล', 1, '2026-04-20 13:26:11'),
(249, 'ทัศนศึกษาแหล่งเรียนรู้นักเรียนชั้นมัธยมศึกษาปีที่ 6', 60, 2, '116655.00', '116655.00', 'นายโสภณ  ท้วมโชติ', 1, '2026-04-20 13:26:11'),
(250, 'วันสวรรคตสมเด็จพระนเรศวรมหาราช', 61, 1, '1000.00', '1000.00', 'นางสาวปภัทรภรณ์  ถาวรกูล', 1, '2026-04-20 13:26:11'),
(251, 'วันฉัตรมงคล', 61, 1, '0.00', '0.00', 'นางสาวสุมาลี  คำสว่าง', 1, '2026-04-20 13:26:11'),
(252, 'วันวิสาขบูชา', 61, 1, '0.00', '0.00', 'นางสาวกัญญาณัฐ  คำยัง', 1, '2026-04-20 13:26:11'),
(253, 'วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสมเด็จพระนางเจ้าฯ พระบรมราชินี', 61, 1, '6800.00', '6800.00', 'นางสาวพรนภา  พาสุวรรณ', 1, '2026-04-20 13:26:11'),
(254, 'แห่เทียนจำนำพรรษา', 61, 1, '6200.00', '6200.00', 'นายกฤษฎิ์ไกรวิชญ์  จันทรัตน์', 1, '2026-04-20 13:26:11'),
(255, 'วันเฉลิมพระชนมพรรษาพระบาทสมเด็จพระวชิรเกล้าเจ้าอยู่หัว', 61, 1, '1800.00', '1800.00', 'นางสาวปภัทรภรณ์  ถาวรกูล', 1, '2026-04-20 13:26:11'),
(256, 'วันแม่แห่งชาติ', 61, 1, '1000.00', '1000.00', 'นางสาวสุนาพร  ดวงใจ', 1, '2026-04-20 13:26:11'),
(257, 'วันนวมินทรมหาราช', 61, 1, '1000.00', '1000.00', 'นางสาวทิพวรรณ  เพชรกันหา', 1, '2026-04-20 13:26:11'),
(258, 'วันปิยมหาราช', 61, 1, '1000.00', '1000.00', 'นางสาวสุธิตา  รัตนทอง', 1, '2026-04-20 13:26:11'),
(259, 'วันพ่อแห่งชาติ', 61, 1, '1000.00', '1000.00', 'นานยสุรัตน์  แซงศรีนวล', 1, '2026-04-20 13:26:11'),
(260, 'วันยุทธหัตถี', 61, 1, '1000.00', '1000.00', 'นายนพดล  คล้ายใจตรง', 1, '2026-04-20 13:26:11'),
(261, 'วันมาฆบูชา', 61, 1, '0.00', '0.00', 'นางสาวมัทณา  หนูขาว', 1, '2026-04-20 13:26:11'),
(262, 'เปิดอาคารเรียน\"ทับทิมจรัส\"', 62, 1, '0.00', '0.00', 'นางสาวภัคธีมา  แก้วยม', 1, '2026-04-20 13:26:11'),
(263, 'มุทิตาจิตภาคกลางคืน', 62, 1, '0.00', '0.00', 'นางสาวภัคธีมา  แก้วยม', 1, '2026-04-20 13:26:11'),
(264, 'วันขึ้นปีใหม่ครู', 62, 1, '0.00', '0.00', 'นางสาวประภาพรรณ  ชอดริ', 1, '2026-04-20 13:26:11'),
(265, 'วันสถาปนาโรงเรียน', 62, 1, '0.00', '0.00', 'นางสาวภัคธีมา  แก้วยม', 1, '2026-04-20 13:26:11'),
(266, 'วันสงกรานต์ภายในโรงเรียน', 62, 1, '0.00', '0.00', 'นางสาวพรนภา  พาสุวรรณ', 1, '2026-04-20 13:26:11'),
(267, 'ส่งเสริมปฐมพยาบาลในโรงเรียน 1/2569', 63, 1, '10000.00', '10000.00', 'นายอรุณโรจน์  บัวคำโคตร', 1, '2026-04-20 13:26:11'),
(268, 'สร้างเสริมสุขภาพ 1/2569', 63, 1, '5000.00', '5000.00', 'นางสาวเปรมจิต  เพชรดี', 1, '2026-04-20 13:26:11'),
(269, 'พัฒนานักเรียนแกนนำเยาวชนแกนนำสาธารณสุขในโรงเรียน 1/2569', 63, 2, '15000.00', '15000.00', 'นายอรุณโรจน์  บัวคำโคตร', 1, '2026-04-20 13:26:11'),
(270, 'ส่งเสริมปฐมพยาบาลในโรงเรียน 2/2569', 63, 1, '17000.00', '17000.00', 'นายอรุณโรจน์  บัวคำโคตร', 1, '2026-04-20 13:26:11'),
(271, 'สร้างเสริมสุขภาพ 2/2569', 63, 1, '3000.00', '3000.00', 'นางสาวเปรมจิต  เพชรดี', 1, '2026-04-20 13:26:11'),
(272, 'พัฒนานักเรียนแกนนำเยาวชนแกนนำสาธารณสุขในโรงเรียน 2/2569', 63, 2, '18000.00', '18000.00', 'นายอรุณโรจน์  บัวคำโคตร', 1, '2026-04-20 13:26:11'),
(273, 'ปรับปรุงระบบเสียงหน้าเสาธง', 64, 1, '52000.00', '52000.00', 'นายทวีศักดิ์  สินทรัพย์', 1, '2026-04-20 13:26:11'),
(274, 'ปรับปรุงระบบเสียงและเครื่องฉายภาพห้องประชุมไพลิน', 64, 1, '18000.00', '18000.00', 'นายทวีศักดิ์  สินทรัพย์', 1, '2026-04-20 13:26:11'),
(275, 'ติดตั้งอุปกรณ์กระจายสัญญาณอินเทอร์เน็ต', 65, 2, '50000.00', '50000.00', 'นายทวีศักดิ์  สินทรัพย์', 1, '2026-04-20 13:26:11'),
(276, 'จัดซื้อซ่อมบำรุงอุปกรณ์/ครุภัณฑ์/วัสดุ ในการทำความสะอาด 1/2569', 66, 1, '70000.00', '70000.00', 'นายทวีศักดิ์  สินทรัพย์', 1, '2026-04-20 13:26:11'),
(277, 'จัดซื้ออุปกรณ์ที่ใช้ในการทำความสะอาด 2/2569', 66, 1, '70000.00', '70000.00', 'นายทวีศักดิ์  สินทรัพย์', 1, '2026-04-20 13:26:11'),
(278, 'ส่งเสริมและพัฒนาการบริหารจัดการ 5 ด้าน 1/2569', 67, 1, '91272.00', '91272.00', 'นางเพลิน  แก้วสุข', 1, '2026-04-20 13:26:11'),
(279, 'ส่งเสริมและพัฒนาการบริหารจัดการ 5 ด้าน 2/2569', 67, 1, '91272.00', '91272.00', 'นางเพลิน  แก้วสุข', 1, '2026-04-20 13:26:11'),
(280, 'พัฒนา ปรับปรุงระบบรางระบายน้ำ', 68, 4, '376226.02', '376226.02', 'นางเพลิน  แก้วสุข', 1, '2026-04-20 13:26:11'),
(281, 'ค่ายพัฒนาศักยภาพสมาชิกชมรมทูบีนัมเบอร์วัน', 69, 2, '26800.00', '26800.00', 'นายสุรวิชญ์  ชิตทอง', 1, '2026-04-20 13:26:11'),
(282, 'วันต่อต้านยาเสพติดโลก', 69, 2, '14000.00', '14000.00', 'นายสุรวิชญ์  ชิตทอง', 1, '2026-04-20 13:26:11'),
(283, 'ส่งเสริมศักยภาพเยาวชนเพื่อความเป็นหนึ่งโดยไม่พึ่งยาเสพติด', 69, 1, '12444.00', '12444.00', 'นายสุรวิชญ์  ชิตทอง', 1, '2026-04-20 13:26:11'),
(284, 'เข้าค่ายพุทธบุตร (กิจกรรมพัฒนาคุณภาพผู้เรียน)', 70, 2, '85000.00', '85000.00', 'นางสาวสุนาพร  ดวงใจ', 1, '2026-04-20 13:26:11'),
(285, 'เข้าค่ายพุทธบุตร (อื่นๆ)', 70, 4, '50000.00', '50000.00', 'นางสาวสุนาพร  ดวงใจ', 1, '2026-04-20 13:26:11'),
(286, 'พนักงานเจ้าหน้าที่ส่งเสริมความประพฤติบุคลิกภาพนักเรียนและปรับพฤติกรรมนักเรียน 1/2569', 71, 1, '0.00', '0.00', 'นายอนุพงษ์  สีสัตย์ซื่อ', 1, '2026-04-20 13:26:11'),
(287, '1 ตำรวจ 1 โรงเรียน 1/2569', 71, 1, '0.00', '0.00', 'นายวิเชียร  สุทธหลวง', 1, '2026-04-20 13:26:11'),
(288, 'ระเบียบการเข้าแถวหน้าเสาธงกิจกรรมตรวจการมาสายของนักเรียน 1/2569', 71, 1, '0.00', '0.00', 'นายปริญญา  ดีนอก', 1, '2026-04-20 13:26:11'),
(289, 'งานคะแนนความประพฤตินักเรียน และรับรองความประพฤตินักเรียน 1/2569', 71, 1, '0.00', '0.00', 'นางสาวศุภลักษณ์  โพธิเลิศ', 1, '2026-04-20 13:26:11'),
(290, 'งานระบบยืนยันตัวตนของนักเรียนและบันทึกการลา 1/2569', 71, 1, '0.00', '0.00', 'นายสมาน  ทวีผล', 1, '2026-04-20 13:26:11'),
(291, 'งานวินัยจราจร 1/2569 (อุดหรุนรายหัว)', 71, 1, '12500.00', '12500.00', 'นายสมชาย  เที่ยงดี', 1, '2026-04-20 13:26:11'),
(292, 'งานวินัยจราจร 1/2569 (กิจกรรมพัฒนาคุณภาพผู้เรียน)', 71, 2, '12000.00', '12000.00', 'นายสมชาย  เที่ยงดี', 1, '2026-04-20 13:26:11'),
(293, 'ปรับพฤติกรรมและการมาสายของนักเรียน 1/2569', 71, 2, '24000.00', '24000.00', 'นายสมาน  ทวีผล', 1, '2026-04-20 13:26:11'),
(294, 'งานจัดทำระเบียบและแนวปฏิบัติของนักเรียน 1/2569', 71, 1, '2000.00', '2000.00', 'นางสาวบุษรินทร์  ตะกรุดแก้ว', 1, '2026-04-20 13:26:11'),
(295, 'พนักงานเจ้าหน้าที่ส่งเสริมความประพฤติบุคลิกภาพนักเรียนและปรับพฤติกรรมนักเรียน 2/2569', 71, 1, '0.00', '0.00', 'นายอนุพงษ์  สีสัตย์ซื่อ', 1, '2026-04-20 13:26:11'),
(296, '1 ตำรวจ 1 โรงเรียน 2/2569', 71, 1, '0.00', '0.00', 'นายวิเชียร  สุทธหลวง', 1, '2026-04-20 13:26:11'),
(297, 'ระเบียบการเข้าแถวหน้าเสาธงกิจกรรมตรวจการมาสายของนักเรียน 2/2569', 71, 1, '0.00', '0.00', 'นายปริญญา  ดีนอก', 1, '2026-04-20 13:26:11'),
(298, 'งานคะแนนความประพฤตินักเรียน และรับรองความประพฤตินักเรียน 2/2569', 71, 1, '0.00', '0.00', 'นางสาวศุภลักษณ์  โพธิเลิศ', 1, '2026-04-20 13:26:11'),
(299, 'งานระบบยืนยันตัวตนของนักเรียนและบันทึกการลา 2/2569', 71, 1, '0.00', '0.00', 'นายสมาน  ทวีผล', 1, '2026-04-20 13:26:11'),
(300, 'งานวินัยจราจร2/2569', 71, 1, '0.00', '0.00', 'นายสมชาย  เที่ยงดี', 1, '2026-04-20 13:26:11'),
(301, 'ปรับพฤติกรรมและการมาสายของนักเรียน 2/2569', 71, 2, '24000.00', '24000.00', 'นายสมาน  ทวีผล', 1, '2026-04-20 13:26:11'),
(302, 'งานจัดทำระเบียบและแนวปฏิบัติของนักเรียน 2/2569', 71, 1, '0.00', '0.00', 'นางสาวบุษรินทร์  ตะกรุดแก้ว', 1, '2026-04-20 13:26:11'),
(303, 'ส่งเสริมประชาธิปไตย (คารวธรรม สามัคคีธรรม ปัญญาธรรม) 1/2569', 72, 2, '7150.00', '7150.00', 'นางสาวปนัดดา  กองมนต์', 1, '2026-04-20 13:26:11'),
(304, 'สร้างเครือข่ายและการศึกษาดูงานสภานักเรียน 1/2569', 72, 2, '19950.00', '19950.00', 'นางสาวปนัดดา  กองมนต์', 1, '2026-04-20 13:26:11'),
(305, 'ส่งเสริิมการประเมินโรงเรียนต้นแบบสภานักเรียน 1/2569', 72, 2, '11550.00', '11550.00', 'นางสาวปนัดดา  กองมนต์', 1, '2026-04-20 13:26:11'),
(306, 'ส่งเสริมประชาธิปไตย (คารวธรรม สามัคคีธรรม ปัญญาธรรม) 2/2569', 72, 2, '27960.00', '27960.00', 'นางสาวปนัดดา  กองมนต์', 1, '2026-04-20 13:26:11'),
(307, 'ส่งเสริิมการประเมินโรงเรียนต้นแบบสภานักเรียน 2/2569', 72, 2, '1390.00', '1390.00', 'นางสาวปนัดดา  กองมนต์', 1, '2026-04-20 13:26:11'),
(308, 'พัฒนาปรับปรุง และจัดซื้อวัสดุ ครุภัณฑ์ กลุ่มบริหารงานกิจการนักเรียน 1/2569', 73, 1, '12500.00', '12500.00', 'นางสาววรรณพร  เหล่ามงคล', 1, '2026-04-20 13:26:11'),
(309, 'พัฒนาปรับปรุง และจัดซื้อวัสดุ ครุภัณฑ์ กลุ่มบริหารงานกิจการนักเรียน 2/2569', 73, 1, '5000.00', '5000.00', 'นางสาววรรณพร  เหล่ามงคล', 1, '2026-04-20 13:26:11'),
(310, 'อบรมมาตรการป้องกันภัย และแผนเผชิญเหตุในสถานศึกษา (อุดหรุนรายหัว)', 74, 1, '4800.00', '4800.00', 'นายปริญญา  ดีนอก', 1, '2026-04-20 13:26:11'),
(311, 'อบรมมาตรการป้องกันภัย และแผนเผชิญเหตุในสถานศึกษา (กิจกรรมพัฒนาคุณภาพผู้เรียน)', 74, 2, '20000.00', '20000.00', 'นายปริญญา  ดีนอก', 1, '2026-04-20 13:26:11'),
(312, 'มาตรการป้องกันภัย และแผนเผชิญเหตุในสถานศึกษา', 74, 2, '0.00', '0.00', 'นายมาโนช  ทัตเศษ', 1, '2026-04-20 13:26:11'),
(313, 'ชั่วโมงคุณธรรมจริยธรรม 1/2569', 75, 1, '10000.00', '10000.00', 'นางสาวกัญญาณัฐ  คำยัง', 1, '2026-04-20 13:26:11'),
(314, 'วันไหว้ครู', 75, 2, '15000.00', '15000.00', 'นายวรวุฒิ  ขวัญนอน', 1, '2026-04-20 13:26:11'),
(315, 'มุทิตาจิต', 75, 1, '0.00', '0.00', 'นางสาวณัฐมล  ภู่สิงห์', 1, '2026-04-20 13:26:11'),
(316, 'ชั่วโมงคุณธรรมจริยธรรม 2/2569', 75, 1, '0.00', '0.00', 'นางสาวกัญญาณัฐ  คำยัง', 1, '2026-04-20 13:26:11'),
(317, 'วัันขึ้นปีใหม่', 75, 1, '10000.00', '10000.00', 'นายโสภณ  ท้วมโชติ', 1, '2026-04-20 13:26:11'),
(318, 'วันงดสูบบุหรี่โลก', 76, 2, '5000.00', '5000.00', 'นายวิเชียร  สุทธหลวง', 1, '2026-04-20 13:26:11'),
(319, 'ห้องเรียนสีขาว', 76, 2, '18650.00', '18650.00', 'นายปริญญา  ดีนอก', 1, '2026-04-20 13:26:11'),
(320, 'การสร้างและพัฒนาเครือข่ายสถานศึกษาสีขาว (MOU)', 76, 2, '0.00', '0.00', 'นายนพดล  คล้ายใจตรง', 1, '2026-04-20 13:26:11'),
(321, 'อบรมแกนนำนักเรียนตามโครงการสถานศึกษาปลอดบุหรี่/บุหรี่ไฟฟ้า และเครื่องดื่มแอลกอฮอล์', 76, 2, '13000.00', '13000.00', 'นายวิเชียร  สุทธหลวง', 1, '2026-04-20 13:26:11'),
(322, 'ห้องเรียนสีขาว 2/2569', 76, 2, '6350.00', '6350.00', 'นายปริญญา  ดีนอก', 1, '2026-04-20 13:26:11'),
(323, 'จัดเตรียมรับการประเมิน', 76, 1, '30000.00', '30000.00', 'นายนพดล  คล้ายใจตรง', 1, '2026-04-20 13:26:11'),
(324, 'ส่งเสริมระบบดูแลช่วยเหลือนักเรียน 1/2569', 77, 1, '0.00', '0.00', 'นางสาวกนกธรณ์  สร้อยโต', 1, '2026-04-20 13:26:11'),
(325, 'ส่งเสริมงานระดับชั้นและครูที่ปรึกษา 1/2569', 77, 1, '0.00', '0.00', 'นางสาวกนกธรณ์  สร้อยโต', 1, '2026-04-20 13:26:11'),
(326, 'รวมพลคนรักลูก 1/2569', 77, 1, '45000.00', '45000.00', 'นางสาวกนกธรณ์  สร้อยโต', 1, '2026-04-20 13:26:11'),
(327, 'ส่งเสริมการคัดกรองนักเรียนและระบบสารสนเทศ Hero Obec Care 1/2569', 77, 1, '0.00', '0.00', 'นางสาวกนกธรณ์  สร้อยโต', 1, '2026-04-20 13:26:11'),
(328, 'ส่งเสริมเครือข่ายผู้ปกครองและบันทึกข้อตกลง MOU 1/2569', 77, 1, '0.00', '0.00', 'นายมาโนช  ทัตเศษ', 1, '2026-04-20 13:26:11'),
(329, 'เยี่ยมบ้านนักเรียน 1/2569', 77, 1, '4300.00', '4300.00', 'นายนพดล  คล้ายใจตรง', 1, '2026-04-20 13:26:11'),
(330, 'งานจิตวิทยาโรงเรียนและการส่งต่อ 1/2569', 77, 1, '0.00', '0.00', 'นางสาวสุภาพร  ศรีโยธา', 1, '2026-04-20 13:26:11'),
(331, 'งานเสริมสร้างทักษะชีวิต 1/2569', 77, 2, '20400.00', '20400.00', 'นางสาวสุนาพร  ดวงใจ', 1, '2026-04-20 13:26:11'),
(332, 'งานโฮมรูม 1/2569', 77, 1, '0.00', '0.00', 'นางสาววรรณพร  เหล่ามงคล', 1, '2026-04-20 13:26:11'),
(333, 'เพื่อนช่วยเพื่อน 1/2569', 77, 1, '0.00', '0.00', 'นางสาวกนกธรณ์  สร้อยโต', 1, '2026-04-20 13:26:11'),
(334, 'ส่งเสริมระบบดูแลช่วยเหลือนักเรียน 2/2569', 77, 1, '0.00', '0.00', 'นางสาวกนกธรณ์  สร้อยโต', 1, '2026-04-20 13:26:11'),
(335, 'ส่งเสริมงานระดับชั้นและครูที่ปรึกษา 2/2569', 77, 1, '0.00', '0.00', 'นางสาวกนกธรณ์  สร้อยโต', 1, '2026-04-20 13:26:11'),
(336, 'รวมพลคนรักลูก 2/2569', 77, 1, '45000.00', '45000.00', 'นางสาวกนกธรณ์  สร้อยโต', 1, '2026-04-20 13:26:11'),
(337, 'ส่งเสริมการคัดกรองนักเรียนและระบบสารสนเทศ Hero Obec Care 2/2569', 77, 1, '0.00', '0.00', 'นางสาวกนกธรณ์  สร้อยโต', 1, '2026-04-20 13:26:11'),
(338, 'ส่งเสริมเครือข่ายผู้ปกครองและบันทึกข้อตกลง MOU 2/2569', 77, 1, '0.00', '0.00', 'นายมาโนช  ทัตเศษ', 1, '2026-04-20 13:26:11'),
(339, 'เยี่ยมบ้านนักเรียน 2/2569', 77, 1, '0.00', '0.00', 'นายนพดล  คล้ายใจตรง', 1, '2026-04-20 13:26:11'),
(340, 'งานจิตวิทยาโรงเรียนและการส่งต่อ 2/2569', 77, 1, '0.00', '0.00', 'นางสาวสุภาพร  ศรีโยธา', 1, '2026-04-20 13:26:11'),
(341, 'งานเสริมสร้างทักษะชีวิต 2/2569', 77, 1, '0.00', '0.00', 'นางสาวสุนาพร  ดวงใจ', 1, '2026-04-20 13:26:11'),
(342, 'งานโฮมรูม 2/2569', 77, 1, '0.00', '0.00', 'นางสาววรรณพร  เหล่ามงคล', 1, '2026-04-20 13:26:11'),
(343, 'เพื่อนช่วยเพื่อน 2/2569', 77, 1, '0.00', '0.00', 'นางสาวกนกธรณ์  สร้อยโต', 1, '2026-04-20 13:26:11'),
(344, 'ค่าจ้างลูกจ้างชั่วคราวประจำสำนักงาน', 78, 3, '328800.00', '328800.00', 'นางสาวรัตติกาล  บัวระพา', 1, '2026-04-20 13:26:11'),
(345, 'ค่าจ้างครูอัตราจ้างชั่วคราว', 78, 3, '366000.00', '366000.00', 'นางสาวรัตติกาล  บัวระพา', 1, '2026-04-20 13:26:11'),
(346, 'ค่าจ้างพนักงานโสตและพนักงานขับรถ', 78, 3, '1314150.00', '1314150.00', 'นางสาวรัตติกาล  บัวระพา', 1, '2026-04-20 13:26:11'),
(347, 'ค่าจ้างอื่น', 78, 3, '154890.00', '154890.00', 'นางสาวรัตติกาล  บัวระพา', 1, '2026-04-20 13:26:11'),
(348, 'ประกันอุบัติเหตุ', 79, 3, '502320.00', '502320.00', 'นางสาวเปรมจิต  เพชรดี', 1, '2026-04-20 13:26:11'),
(349, 'พัฒนาระบบดูแลช่วยเหลือนักเรียนด้วยอิเล็กทรอนิกส์', 80, 3, '70000.00', '70000.00', 'นายสมาน  ทวีผล', 1, '2026-04-20 13:26:11'),
(350, 'ปรับปรุงห้องน้ำนักเรียน', 81, 3, '200000.00', '200000.00', 'นายทวีศักดิ์  สินทรัพย์', 1, '2026-04-20 13:26:11'),
(351, 'พัฒนาระบบกระจายสัญญาณอินเทอร์เน็ตแบบไร้สาย', 81, 3, '100000.00', '100000.00', 'นายทวีศักดิ์  สินทรัพย์', 1, '2026-04-20 13:26:11'),
(352, 'พัฒนาปรับปรุง วัสดุ อุปกรณ์ ครุภัณฑ์ห้องเรียน/หอประชุม', 81, 3, '50000.00', '50000.00', 'นางสาวปิยาภรณ์  สีหาปัญญา', 1, '2026-04-20 13:26:11'),
(353, 'พัฒนาสถานที่จอดรถจักรยานยนต์ของนักเรียน', 81, 3, '100000.00', '100000.00', 'นายสมชาย  เที่ยงดี', 1, '2026-04-20 13:26:11'),
(354, 'พัฒนาระบบดูแลความปลอดภัย (กล้องวงจรปิด)', 81, 3, '80000.00', '80000.00', 'นายพรเทพ  พาณิชย์กุล', 1, '2026-04-20 13:26:11'),
(355, 'พัฒนาจุดบริการน้ำดื่มสะอาด', 81, 3, '90000.00', '90000.00', 'นายพิพัฒณ์พล  เนตรทิพย์', 1, '2026-04-20 13:26:11'),
(356, 'เทศกาลตรุษจีน', 82, 3, '0.00', '0.00', 'นางสาวมณธิชา  สิทธิยศ', 1, '2026-04-20 13:26:11'),
(357, 'การดำเนินการจัดทำธุรกรรมเกี่ยวกับคุณสมบัติของครูต่างชาติ', 82, 3, '22300.00', '22300.00', 'นางสาวมณธิชา  สิทธิยศ', 1, '2026-04-20 13:26:11'),
(358, 'ค่ายพัฒนาทักษะภาษาจีน', 82, 3, '0.00', '0.00', 'นางสาวมณธิชา  สิทธิยศ', 1, '2026-04-20 13:26:11'),
(359, 'ส่งเสริมภาษาและวัฒนธรรมจีน', 82, 3, '0.00', '0.00', 'นางสาวมณธิชา  สิทธิยศ', 1, '2026-04-20 13:26:11'),
(360, 'ห้องปฏิบัติการทางภาษา', 82, 3, '0.00', '0.00', 'นางสาวมณธิชา  สิทธิยศ', 1, '2026-04-20 13:26:11'),
(361, 'การจัดสรรเงินเดือนและสวัสดิการให้ครูต่างชาติหรือผู้เชี่ยวชาญด้านภาษาจีน', 82, 3, '331700.00', '331700.00', 'นางสาวมณธิชา  สิทธิยศ', 1, '2026-04-20 13:26:11'),
(362, 'การจัดสรรเงินเดือนครูต่างชาติ', 83, 3, '620000.00', '620000.00', 'นางสมฤดี  สุทธหลวง', 1, '2026-04-20 13:26:11'),
(363, 'พัฒนาห้องแหล่งเรียนรู้ภาษาต่างประเทศ', 83, 3, '10000.00', '10000.00', 'นางสาวศรัณย์พร  สูงสกุล', 1, '2026-04-20 13:26:11'),
(364, 'love at first meet สานสัมพันธ์ศิลป์ภาษาอังกฤษ', 83, 3, '10000.00', '10000.00', 'นางสมฤดี  สุทธหลวง', 1, '2026-04-20 13:26:11'),
(365, 'วันคริสต์มาส', 83, 3, '33768.00', '33768.00', 'นางสมฤดี  สุทธหลวง', 1, '2026-04-20 13:26:11'),
(366, 'ค่ายวัฒนธรรม Goodbye Senior', 83, 3, '30000.00', '30000.00', 'นางสาวศรัณย์พร  สูงสกุล', 1, '2026-04-20 13:26:11'),
(367, 'การรับสมัคร / คัดเลือกนักเรียนห้องเรียนพิเศษ SEM ม.1 และ ม.4 ปีการศึกษา2569', 84, 3, '5000.00', '5000.00', 'นางสาวกมลรัตน์  จันทร์น้อย', 1, '2026-04-20 13:26:11'),
(368, 'การพัฒนาหลักสูตรและการเรียนการสอนห้องเรียนพิเศษ SEM', 84, 3, '1000.00', '1000.00', 'นางสาวศิริมา  จำปารอด', 1, '2026-04-20 13:26:11'),
(369, 'สรรหาบุคลากรสนับสนุนการศึกษาห้องเรียนพิเศษ SEM ปีการศึกษา2569', 84, 3, '0.00', '0.00', 'นายพิพัฒณ์พล  เนตรทิพย์', 1, '2026-04-20 13:26:11'),
(370, 'การจัดซื้อวัสดุ อุปกรณ์และซ่อมแซมวัสดุ ครุภัณฑ์ห้องเรียนพิเศษ SEMปีการศึกษา2569', 84, 3, '40000.00', '40000.00', 'นายชัยภัค  เทียนทอง', 1, '2026-04-20 13:26:11'),
(371, 'ปรับความรู้พื้นฐานสำหรับนักเรียนห้องเรียนพิเศษ SEM ครอบครัวตัว', 84, 3, '15000.00', '15000.00', 'นายชัยภัค  เทียนทอง', 1, '2026-04-20 13:26:11'),
(372, 'สอนเสริมเพิ่มความรู้ทางวิทยาศาสตร์ ภาษาอังกฤษและคณิตศาสตร์ สำหรับนักเรียนห้องเรียนพิเศษ SEM ม.1 และม.4 ปีการศึกษา2569', 84, 3, '253440.00', '253440.00', 'นายชัยภัค  เทียนทอง', 1, '2026-04-20 13:26:11'),
(373, 'เสริมทักษะทางวิทยาศาสตร์ ภาษาอังกฤษ และคณิตศาสตร์ด้วยการจัดค่าย', 84, 3, '160600.00', '160600.00', 'นายชัยภัค  เทียนทอง', 1, '2026-04-20 13:26:11'),
(374, 'ทัศนศึกษาจัดการเรียนรู้สู่โลกกว้าง (SEM)', 84, 3, '70000.00', '70000.00', 'นายชัยภัค  เทียนทอง', 1, '2026-04-20 13:26:11'),
(375, 'เสริมสร้างศักยภาพครูSEM สู่ครูในยุคศตวรรษที่ 21', 84, 3, '10000.00', '10000.00', 'นางปคุณาณัช  ทองแจ่ม', 1, '2026-04-20 13:26:11'),
(376, 'สู่ความเป็นเลิศนักเรียน SEM สู่เวที สอวน.', 84, 3, '3000.00', '3000.00', 'นางนิลุบล  สำเภา', 1, '2026-04-20 13:26:11'),
(377, 'ส่งเสริมการประเมินระดับความสามารถทางภาษาตามกรอบมาตรฐานสากล', 84, 3, '9000.00', '9000.00', 'นางสมฤดี  สุทธหลวง', 1, '2026-04-20 13:26:11');
INSERT INTO `activity` (`act_id`, `act_name`, `pro_id`, `bgt_id`, `act_money`, `act_balance`, `act_user`, `create_by`, `create_at`) VALUES
(378, 'ส่งเสริมการเรียนรู้สู่ความเป็นเลิศ SEM สำหรับนักเรียนห้องเรียนพิเศษ SEM ปีการศึกษา25569', 84, 3, '32960.00', '32960.00', 'นายชัยภัค  เทียนทอง', 1, '2026-04-20 13:26:11'),
(379, 'ปั้นฝันเด็กอัจฉริยะ ม.6', 84, 3, '0.00', '0.00', 'นางวิมลรัตน์  รูปแก้ว', 1, '2026-04-20 13:26:11'),
(380, 'การจั่ายค่าสาธารณูปโภคของโครงการ ห้องเรียนพิเศษ SEM ปีการศึกษา 2569 (ค่าไฟฟ้า)', 84, 3, '60000.00', '60000.00', 'นายชัยภัค  เทียนทอง', 1, '2026-04-20 13:26:11'),
(381, 'การรับสมัคร / คัดเลือกนักเรียนห้องเรียนพิเศษ SEM ม.1 และ ม.4 ปีการศึกษา2569', 85, 3, '0.00', '0.00', 'นางสาวกมลรัตน์  จันทร์น้อย', 1, '2026-04-20 13:26:11'),
(382, 'การพัฒนาหลักสูตรและการเรียนการสอนห้องเรียนพิเศษ SEM', 85, 3, '0.00', '0.00', 'นางสาวศิริมา  จำปารอด', 1, '2026-04-20 13:26:11'),
(383, 'สรรหาบุคลากรสนับสนุนการศึกษาห้องเรียนพิเศษ SEM ปีการศึกษา2569', 85, 3, '0.00', '0.00', 'นายพิพัฒณ์พล  เนตรทิพย์', 1, '2026-04-20 13:26:11'),
(384, 'การจัดซื้อวัสดุ อุปกรณ์และซ่อมแซมวัสดุ ครุภัณฑ์ห้องเรียนพิเศษ SEMปีการศึกษา2569', 85, 3, '20000.00', '20000.00', 'นายพิพัฒณ์พล  เนตรทิพย์', 1, '2026-04-20 13:26:11'),
(385, 'ปรับความรู้พื้นฐานสำหรับนักเรียนห้องเรียนคุณภาพ SEM ครอบครัวตัวSEM (SEM Family) ปีการศึกษา2569', 85, 3, '13120.00', '13120.00', 'นายชัยภัค  เทียนทอง', 1, '2026-04-20 13:26:11'),
(386, 'สอนเสริมเพิ่มความรู้ทางวิทยาศาสตร์ ภาษาอังกฤษ และคณิตศาสตร์สำหรับนักเรียนห้องเรียนคุณภาพ SEM ม.2 ม.3 ม.5 ม.6 ปีการศึกษา2569', 85, 3, '161920.00', '161920.00', 'นายชัยภัค  เทียนทอง', 1, '2026-04-20 13:26:11'),
(387, 'เสริมทักษะทางวิทยาศาสตร์ ภาษาอังกฤษ และคณิตศาสตร์ดด้วยการจัดค่าย', 85, 3, '40000.00', '40000.00', 'นายชัยภัค  เทียนทอง', 1, '2026-04-20 13:26:11'),
(388, 'ทัศนศึกษาจัดการเรียนรู้สู่โลกกว้าง', 85, 3, '50000.00', '50000.00', 'นายชัยภัค  เทียนทอง', 1, '2026-04-20 13:26:11'),
(389, 'เสริมสร้างศักยภาพครูSEM สู่ครูในยุคศตวรรษที่ 21', 85, 3, '0.00', '0.00', 'นางปคุณาณัช  ทองแจ่ม', 1, '2026-04-20 13:26:11'),
(390, 'สู่ความเป็นเลิศนักเรียน SEM สู่เวที สอวน.', 85, 3, '0.00', '0.00', 'นางนิลุบล  สำเภา', 1, '2026-04-20 13:26:11'),
(391, 'ส่งเสริมการประเมินระดับความสามารถทางภาษาตามกรอบมาตรฐานสากล', 85, 3, '0.00', '0.00', 'นางสมฤดี  สุทธหลวง', 1, '2026-04-20 13:26:11'),
(392, 'ส่งเสริมการเรียนรู้สู่ความเป็นเลิศ SEM สำหรับนักเรียนห้องเรียนพิเศษ SEM ปีการศึกษา25569', 85, 3, '8560.00', '8560.00', 'นายชัยภัค  เทียนทอง', 1, '2026-04-20 13:26:11'),
(393, 'ปั้นฝันเด็กอัจฉริยะ ม.6', 85, 3, '0.00', '0.00', 'นางวิมลรัตน์  รูปแก้ว', 1, '2026-04-20 13:26:11'),
(394, 'การจั่ายค่าสาธารณูปโภคของโครงการ ห้องเรียนพิเศษ SEM ปีการศึกษา 2569 (ค่าไฟฟ้า)', 85, 3, '164000.00', '164000.00', 'นายชัยภัค  เทียนทอง', 1, '2026-04-20 13:26:11'),
(395, 'การจัดสรรเงินเดือนและสวัสดิการให้ครูต่างชาติหรือผู้เชี่ยวชาญด้านภาษาเกาหลี 1/2569', 86, 3, '90000.00', '90000.00', 'นางสมฤดี  สุทธหลวง', 1, '2026-04-20 13:26:11'),
(396, 'การแข่งขันทักษะวิชาการภาษาเกาหลี (การแข่งขันภายใน)', 86, 3, '6000.00', '6000.00', 'นางสาววิชญาพร  อุดใจ', 1, '2026-04-20 13:26:11'),
(397, 'วันชูซ็อก (วันไหว้พระจันทร์)', 86, 3, '16000.00', '16000.00', 'นางสาววิชญาพร  อุดใจ', 1, '2026-04-20 13:26:11'),
(398, 'ส่งเสริมการจัดการเรียนการสอน', 86, 3, '10500.00', '10500.00', 'นางสาววิชญาพร  อุดใจ', 1, '2026-04-20 13:26:11'),
(399, 'ส่งเสริมภาษาและวัฒนธรรมเกาหลี', 86, 3, '31500.00', '31500.00', 'นางสาววิชญาพร  อุดใจ', 1, '2026-04-20 13:26:11'),
(400, 'การจัดสรรเงินเดือนและสวัสดิการให้ครูต่างชาติหรือผู้เชี่ยวชาญด้านภาษาเกาหลี 2/569', 86, 3, '90000.00', '90000.00', 'นางสมฤดี  สุทธหลวง', 1, '2026-04-20 13:26:11'),
(401, 'วันซอลลัล', 86, 3, '16000.00', '16000.00', 'นางสาววิชญาพร  อุดใจ', 1, '2026-04-20 13:26:11'),
(402, 'จัดหาเครื่องคอมพิวเตอร์ และอุปกรณ์ต่อพ่วง เพื่อการจัดการเรียนรู้', 87, 3, '250000.00', '250000.00', 'นายทวีศักดิ์  สินทรัพย์', 1, '2026-04-20 13:26:11'),
(403, 'ส่งเสริมความรู้ความสามารถทางด้านเทคโนโลยีสารสนเทศ', 87, 3, '100000.00', '100000.00', 'นายทวีศักดิ์  สินทรัพย์', 1, '2026-04-20 13:26:11'),
(404, 'ซ่อมบำรุงสื่อและเครื่องคอมพิวเตอร์ประจำห้องเรียนคอมพิวเตอร์', 87, 3, '150000.00', '150000.00', 'นายทวีศักดิ์  สินทรัพย์', 1, '2026-04-20 13:26:11'),
(405, 'ซ่อมบำรุง ปรับปรุงและพัฒนาห้องเรียนคอมพิวเตอร์', 87, 3, '118240.00', '118240.00', 'นายทวีศักดิ์  สินทรัพย์', 1, '2026-04-20 13:26:11'),
(406, 'ซื้อเครื่องครัว 1/69', 88, 3, '0.00', '0.00', 'นางสาวพรนภา  พาสุวรรณ', 1, '2026-04-20 13:26:11'),
(407, 'ซื้ออุปกรณ์ ทำความสะอาด 1/69', 88, 3, '5609.00', '5609.00', 'นางสาวเปรมจิต เพชรดี', 1, '2026-04-20 13:26:11'),
(408, 'ปรับปรุงซ่อมแซมโรงอาหาร1/69', 88, 3, '200000.00', '200000.00', 'นางสาวกัญญาณัฐ  คำยัง', 1, '2026-04-20 13:26:11'),
(409, 'ซื้อเครื่องครัว 2/69', 88, 3, '0.00', '0.00', 'นางสาวพรนภา  พาสุวรรณ', 1, '2026-04-20 13:26:11'),
(410, 'ซื้ออุปกรณ์ ทำความสะอาด 2/69', 88, 3, '4110.00', '4110.00', 'นางสาวเปรมจิต เพชรดี', 1, '2026-04-20 13:26:11'),
(411, 'ปรับปรุงซ่อมแซมโรงอาหาร2/69', 88, 3, '7206.00', '7206.00', 'นางสาวกัญญาณัฐ  คำยัง', 1, '2026-04-20 13:26:11'),
(412, 'รับสมัครแม่ค้า', 88, 3, '1920.00', '1920.00', 'นางสุกัญญา  จุมพรม', 1, '2026-04-20 13:26:11'),
(413, 'เงินประกันของเสียหายสำหรับร้านค้า', 88, 3, '54000.00', '54000.00', 'นางสุกัญญา  จุมพรม', 1, '2026-04-20 13:26:11'),
(414, 'ค่าสาธารณูปโภคสมทบ', 88, 3, '27000.00', '27000.00', 'นางสุกัญญา  จุมพรม', 1, '2026-04-20 13:26:11');

-- --------------------------------------------------------

--
-- Table structure for table `budgettype`
--

CREATE TABLE `budgettype` (
  `bgt_id` int(11) NOT NULL,
  `bgt_name` varchar(150) NOT NULL COMMENT 'ชื่อประเภทงบประมาณ',
  `status` tinyint(1) UNSIGNED NOT NULL,
  `create_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Dumping data for table `budgettype`
--

INSERT INTO `budgettype` (`bgt_id`, `bgt_name`, `status`, `create_at`) VALUES
(1, 'อุดหนุนรายหัว', 1, '2020-10-24 18:44:25'),
(2, 'กิจกรรมพัฒนาคุณภาพผู้เรียน', 1, '2020-10-24 18:44:25'),
(3, 'รายได้สถานศึกษา', 1, '2020-10-24 18:44:47'),
(4, 'อื่น ๆ', 1, '2020-10-24 18:44:47');

-- --------------------------------------------------------

--
-- Table structure for table `department`
--

CREATE TABLE `department` (
  `dep_id` int(11) NOT NULL COMMENT 'รหัสกลุ่ม',
  `dep_name` varchar(100) NOT NULL COMMENT 'ชื่อกลุ่ม',
  `dep_user` varchar(100) NOT NULL COMMENT 'ชื่อหัวหน้ากลุ่ม',
  `dep_pos` varchar(100) NOT NULL COMMENT 'ตำแหน่ง',
  `man_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Dumping data for table `department`
--

INSERT INTO `department` (`dep_id`, `dep_name`, `dep_user`, `dep_pos`, `man_id`) VALUES
(1, 'กลุ่มบริหารวิชาการ', 'นางอรอุมา ลักษณะทอง', 'หัวหน้ากลุ่มบริหารวิชาการ', 1),
(2, 'กลุ่มบริหารงานบุคคล', 'นางนิลุบล สำเภา', 'หัวหน้ากลุ่มบริหารงานบุคคล', 2),
(3, 'กลุ่มบริหารงบประมาณ', 'นางสาวสมรัศมิ์ สายทอง', 'หัวหน้ากลุ่มบริหารงบประมาณ', 3),
(4, 'กลุ่มบริหารทั่วไป', 'นายพิพัฒณ์พล เนตรทิพย์', 'หัวหน้ากลุ่มบริหารทั่วไป', 4),
(5, 'กลุ่มบริหารกิจการนักเรียน', 'นายสมาน ทวีผล', 'หัวหน้ากลุ่มบริหารกิจการนักเรียน', 5);

-- --------------------------------------------------------

--
-- Table structure for table `management`
--

CREATE TABLE `management` (
  `man_id` int(11) NOT NULL COMMENT 'รหัสกลุ่มบริหาร',
  `man_name` varchar(50) NOT NULL COMMENT 'กลุ่มบริหาร',
  `man_user` varchar(50) NOT NULL COMMENT 'ชื่อผู้บริหาร',
  `man_pos` varchar(80) NOT NULL COMMENT 'ตำแหน่ง'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Dumping data for table `management`
--

INSERT INTO `management` (`man_id`, `man_name`, `man_user`, `man_pos`) VALUES
(1, 'กลุ่มบริหารวิชาการ', 'นายพัฒนพงษ์ นามพิมพ์', 'รองผู้อำนวยการฯ กลุ่มบริหารวิชาการ'),
(2, 'กลุ่มบริหารงานบุคคล', 'นางสาวณัฏฐ์ธนัน รำเจริญ', 'รองผู้อำนวยการฯ กลุ่มบริหารงานบุคคล'),
(3, 'กลุ่มบริหารงบประมาณ', 'นางสาวธนภรณ์ เชื้อเพ็ง', 'รองผู้อำนวยการฯ กลุ่มบริหารงบประมาณ'),
(4, 'กลุ่มบริหารทั่วไป', 'นางศริญาภัสร์ ชัชโชติสวัสดิ์', 'รองผู้อำนวยการฯ กลุ่มบริหารทั่วไป'),
(5, 'กลุ่มบริหารกิจการนักเรียน', 'นายพัฒนพงษ์ นามพิมพ์', 'รองผู้อำนวยการฯ กลุ่มบริหารกิจการนักเรียน'),
(6, 'ผู้บริหารสถานศึกษา', 'นายธนัญชัย พรหมภักดี', 'ผู้อำนวยการโรงเรียนนิยมศิลป์อนุสรณ์');

-- --------------------------------------------------------

--
-- Table structure for table `payplan`
--

CREATE TABLE `payplan` (
  `pay_id` int(11) NOT NULL COMMENT 'รหัสการเบิกเงินตามแผน',
  `act_id` int(11) NOT NULL COMMENT 'รหัสกิจกรรมfk',
  `pay_order` int(11) NOT NULL COMMENT 'เลขที่คำขอ',
  `dep_order` int(11) NOT NULL COMMENT 'รหัสกลุ่มที่ขอ',
  `pay_money` decimal(10,2) NOT NULL COMMENT 'จำนวนเงินที่ขอเบิก',
  `pay_user` varchar(150) NOT NULL COMMENT 'ผู้ของเบิก',
  `pay_objective` text NOT NULL COMMENT 'วัตถุประสงค์การใช้',
  `pay_type` varchar(30) NOT NULL COMMENT 'ประเภทที่ขอ',
  `pay_date` datetime NOT NULL DEFAULT current_timestamp() COMMENT 'วดปที่เบิก',
  `pay_step` int(11) NOT NULL COMMENT 'สถานะดำเนิการ',
  `pay_bill` decimal(10,2) DEFAULT NULL,
  `create_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT 'วันที่ทำรายการ',
  `person_id` int(11) NOT NULL COMMENT 'รหัสผู้บันทึก'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `persons`
--

CREATE TABLE `persons` (
  `id` int(10) UNSIGNED NOT NULL,
  `firstname` varchar(255) NOT NULL,
  `lastname` varchar(255) NOT NULL,
  `dob` date DEFAULT NULL,
  `gender_id` int(11) DEFAULT NULL,
  `dep_id` int(11) DEFAULT NULL,
  `salary` decimal(15,2) DEFAULT NULL,
  `avatar` varchar(255) DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Dumping data for table `persons`
--

INSERT INTO `persons` (`id`, `firstname`, `lastname`, `dob`, `gender_id`, `dep_id`, `salary`, `avatar`, `created_at`) VALUES
(1, 'budget', 'admin', '2020-01-01', 1, 0, '0.00', '', '2026-04-20 14:11:20'),
(2, 'admin', 'nabudget', '2020-01-01', 1, 4, '0.00', '', '2026-04-20 16:47:59'),
(3, 'ศิรประภา ', 'สุระมาตย์', '2020-01-01', 1, 3, '0.00', '', '2026-05-01 15:10:26'),
(4, 'กฤษฎิ์ไกรวิชญ์', 'จันทรัตน์', '2020-01-01', 1, 3, '0.00', '../../../assets/images/avatar/06ec142163623a83551fe1f2ebff4a64.jpg', '2026-05-01 15:23:26'),
(5, 'มะลิสา', 'ทวดสุวรรณ์', '2020-01-01', 2, 3, '0.00', '', '2026-05-01 15:26:31');

-- --------------------------------------------------------

--
-- Table structure for table `project`
--

CREATE TABLE `project` (
  `pro_id` int(11) NOT NULL COMMENT 'รหัสโครงการ',
  `pro_code` varchar(50) NOT NULL COMMENT 'เลขรหัสโครงการ',
  `pro_name` varchar(255) NOT NULL COMMENT 'ชื่อโครงการ',
  `pro_user` varchar(255) NOT NULL COMMENT 'ผู้รับผิดชอบโครงการ',
  `dep_id` int(11) NOT NULL COMMENT 'รหัสกลุ่ม',
  `man_id` int(11) NOT NULL COMMENT 'รหัสกลุ่มบริหาร',
  `create_at` datetime DEFAULT current_timestamp() COMMENT 'วดปเพิ่มข้อมูล'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Dumping data for table `project`
--

INSERT INTO `project` (`pro_id`, `pro_code`, `pro_name`, `pro_user`, `dep_id`, `man_id`, `create_at`) VALUES
(1, 'บจ01/69', 'ค่าสาธารณูปโภค', 'นางสาวจารุวรรณ  พุกภัย', 3, 3, '2026-04-20 13:15:22'),
(2, 'บจ02/69', 'ซ่อมบำรุงรถยนต์โรงเรียน', 'นายสมชาย  เที่ยงดี', 3, 3, '2026-04-20 13:15:22'),
(3, 'บจ03/69', 'น้ำมันและเชื้อเพลิงโรงเรียน', 'นางอนงค์นาฏ  พรมดี', 3, 3, '2026-04-20 13:15:22'),
(4, 'บจ04/69', 'สนับสนุนการเดินทางเพื่อพัฒนาการจัดการศึกษา', 'นางนิลุบล  สำเภา', 2, 2, '2026-04-20 13:15:22'),
(5, 'บจ05/69', 'พัฒนางานอำนวยการ', 'นางเพลิน  แก้วสุข', 4, 4, '2026-04-20 13:15:22'),
(6, 'วช01/69', 'ส่งเสริมงานนิเทศการศึกษา', 'นางปาลิกา  ทัตเศษ', 1, 1, '2026-04-20 13:15:22'),
(7, 'วช02/69', 'พัฒนาระบบประกันคุณภาพภายในและมาตรฐานการศึกษาของโรงเรียนนิยมศิลป์อนุสรณ์', 'นางปคุณาณัช  ทองแจ่ม', 1, 1, '2026-04-20 13:15:22'),
(8, 'วช03/69', 'พัฒนาคุณภาพกิจกรรมนักเรียนในกลุ่มกิจกรรมพัฒนาผู้เรียน', 'นางปาลิกา  ทัตเศษ', 1, 1, '2026-04-20 13:15:22'),
(9, 'วช04/69', 'ส่งเสริมและพัฒนาระบบงานทะเบียนนักเรียน', 'นางวิมลรัตน์  รูปแก้ว', 1, 1, '2026-04-20 13:15:22'),
(10, 'วช05/69', 'ส่งเสริมการใช้หลักปรัชญาของเศรษฐกิจพอเพียง', 'นายสุรัตน์  แซงศรีนวล', 1, 1, '2026-04-20 13:15:22'),
(11, 'วช06/69', 'พัฒนางานแนะแนว', 'นางสาวสุภาพร  ศรีโยธา', 1, 1, '2026-04-20 13:15:22'),
(12, 'วช07/69', 'พัฒนางานห้องสมุด', 'นายชัชวานนท์  สงคราม', 1, 1, '2026-04-20 13:15:22'),
(13, 'วช08/69', 'ส่งเสริมงานกิจกรรมนักเรียนเพื่อนที่ปรึกษา YC : Touth Counseler)', 'นางสาวกนกธรณ์  สร้อยโต', 1, 1, '2026-04-20 13:15:22'),
(14, 'วช09/69', 'พัฒนาระบบงานรับนักเรียนใหม่', 'นางสาวกมลรัตน์  จันทร์น้อย', 1, 1, '2026-04-20 13:15:22'),
(15, 'วช10/69', 'งานพัฒนาและใช้สื่อเทคโนโลยีเพื่อการศึกษา', 'นางสาวบุษรินทร์  ตะกรุดแก้ว', 1, 1, '2026-04-20 13:15:22'),
(16, 'วช11/69', 'ส่งเสริมชุมชนให้มีความเข้มแข็งทางวิชาการ', 'นางสาวกฤติญาภรณ์  จงอุ้มกลาง', 1, 1, '2026-04-20 13:15:22'),
(17, 'วช12/69', 'ส่งเสริมทักษะการค้นพบตนเองและเพิ่มประสบการณ์อาชีพเพื่ออนาคต', 'นางสาวสุภาพร  ศรีโยธา', 1, 1, '2026-04-20 13:15:22'),
(18, 'วช13/69', 'ศูนย์ผลิตสื่อและนวัตกรรมการประเมินผล', 'นายพิพัฒณ์พล  เนตรทิพย์', 1, 1, '2026-04-20 13:15:22'),
(19, 'วช14/69', 'จัดหาวัสดุอุปกรณ์เพื่อเพิ่มประสิทธิภาพการวัดผล', 'นายพิพัฒณ์พล  เนตรทิพย์', 1, 1, '2026-04-20 13:15:22'),
(20, 'วช15/69', 'ส่งเสริมและพัฒนางานโรงเรียนมาตรฐานสากล ระดับTQA', 'นางวิมลรัตน์  รูปแก้ว', 1, 1, '2026-04-20 13:15:22'),
(21, 'วช16/69', 'พัฒนาการประเมินคุณภาพผู้เรียน', 'นางสิรินารถ  สรรพอาสา', 1, 1, '2026-04-20 13:15:22'),
(22, 'วช17/69', 'พัฒนาหลักสูตรสถานศึกษา', 'นางสาวศิริมา  จำปารอด', 1, 1, '2026-04-20 13:15:22'),
(23, 'วช18/69', 'พัฒนางานวิจัยเพื่อพัฒนาคุณภาพการศึกษาในสถานศึกษา', 'นางสาวปนัดดา  กองมนต์', 1, 1, '2026-04-20 13:15:22'),
(24, 'วช19/69', 'พัฒนาและส่งเสริมให้มีแหล่งเรียนรู้และภูมิปัญญาท้องถิ่น', 'นางสาวทิพวรรณ  เพชรกันหา', 1, 1, '2026-04-20 13:15:22'),
(25, 'วช20/69', 'พัฒนาทักษะและคุณลักษณะที่พึงประสงค์ของนักศึกษาฝึกประสบการณ์วิชาชีพครูในสถานศึกษา', 'นางรวีวรรณ  โชคชัยชีวากร', 1, 1, '2026-04-20 13:15:22'),
(26, 'วช21/69', 'พัฒนาการจัดการเรียนการสอนกลุ่มสาระการเรียนรู้ศิลปะ', 'นายสมาน  ทวีผล', 1, 1, '2026-04-20 13:15:22'),
(27, 'วช22/69', 'พัฒนาการจัดการเรียนการสอนกลุ่มสาระการเรียนรู้ภาษาไทย', 'นางสาวณัฐมล  ภู่สิงห์', 1, 1, '2026-04-20 13:15:22'),
(28, 'วช23/69', 'พัฒนาการจัดการเรียนการสอนกลุ่มสาระการเรียนรู้ภาษาต่างประเทศ', 'นางสมฤดี  สุทธหลวง', 1, 1, '2026-04-20 13:15:22'),
(29, 'วช24/69', 'พัฒนาการจัดการเรียนการสอนกลุ่มสาระการเรียนรู้สังคมศึกษา ศาสนา และวัฒนธรรม', 'นางสาวกัญญาณัฐ  คำยัง', 1, 1, '2026-04-20 13:15:22'),
(30, 'วช25/69', 'พัฒนาการจัดการเรียนการสอนกลุ่มสาระการเรียนรู้การงานอาชีพ', 'นางศิรประภา  สุระมาตย์', 1, 1, '2026-04-20 13:15:22'),
(31, 'วช26/69', 'พัฒนาการจัดการเรียนการสอนกลุ่มสาระการเรียนรู้วิทยาศาสตร์ และเทคโนโลยี', 'นางสาวทิพธิพร  ห่วงยา', 1, 1, '2026-04-20 13:15:22'),
(32, 'วช27/69', 'พัฒนาการจัดการเรียนการสอนกลุ่มสาระการเรียนรู้คณิตศาสตร์', 'นายชัยภัค  เทียนทอง', 1, 1, '2026-04-20 13:15:22'),
(33, 'วช28/69', 'พัฒนาการจัดการเรียนการสอนกลุ่มสาระการเรียนรู้สุขศึกษาและพลศึกษา', 'นายสมชาย เที่ยงดี', 1, 1, '2026-04-20 13:15:22'),
(34, 'วช29/69', 'ส่งเสริมการขับเคลื่อนโอลิมปิกวิชาการ', 'นางนิลุบล  สำเภา', 1, 1, '2026-04-20 13:15:22'),
(35, 'วช30/69', 'ส่งเสริมเจตคติที่ดีของนักเรียน ปีการศึกษา2569', 'นายโสภณ  ท้วมโชติ', 1, 1, '2026-04-20 13:15:22'),
(36, 'วช31/69', 'ส่งเสริมศักยภาพนักเรียนห้องเรียนศิลป์ - คำนวณ', 'นายกฤษฎิ์ไกรวิชญ์  จันทรัตน์', 1, 1, '2026-04-20 13:15:22'),
(37, 'วช32/69', 'ประเมินและพัฒนาสู่ความเป็นเลิศทางคณิตศาสตร์ และวิทยาศาสตร์ (TEDET) ของโรงเรียนนิยมศิลป์อนุสรณ์', 'นางสาววรรณิษา  สีโถ', 1, 1, '2026-04-20 13:15:22'),
(38, 'วช33/69', 'เปิดโลกวิชาการเปิดบ้านแห่งการเรียนรู้ ส่งเสริมการแสดงศักยภาพของนักเรียน', 'นางอรอุมา  ลักษณะทอง', 1, 1, '2026-04-20 13:15:22'),
(39, 'วช34/69', 'พัฒนาและส่งเสริมโรงเรียนคุณภาพวิทยาศาสตร์ คณิตศาสตร์ และเทคโนโลยีตามมาตรฐาน สสวท. (โรงเรียนคุณภาพ SMT สสวท.)', 'นางสาวธารารัตน์  ดวงจันทร์', 1, 1, '2026-04-20 13:15:22'),
(40, 'วช35/69', 'ส่งเสริมความเป็นเลิศทางวิชาการ โรงเรียนนิยมศิลป์อนุสรณ์', 'นางอรอุมา  ลักษณะทอง', 1, 1, '2026-04-20 13:15:22'),
(41, 'วช36/69', 'ส่งเสริมความเป็นเลิศทางกีฬา', 'นายสมชาย เที่ยงดี', 1, 1, '2026-04-20 13:15:22'),
(42, 'วช37/69', 'เดินทางไกลและอยู่ค่ายพักแรมลูกเสือเนตรนารี และยุวกาชาด', 'นางปาลิกา  ทัตเศษ', 1, 1, '2026-04-20 13:15:22'),
(43, 'วช38/69', 'ส่งเสริมและปลูกฝังความรักชาติ ศาสนา พระมหากษัตริย์ วัฒนธรรมและประเพณีท้องถิ่น', 'นางอรอุมา  ลักษณะทอง', 1, 1, '2026-04-20 13:15:22'),
(44, 'วช39/69', 'บูรณาการการบริหารงานวิชาการสู่ความเป็นเลิศทางการเรียนรู้', 'นางเพลิน  แก้วสุข', 1, 1, '2026-04-20 13:15:22'),
(45, 'วช40/69', 'จัดซื้อหนังสือเรียนระดับชั้นมัธยมศึกษาปีที่ 1 - 6 ปีการศึกษา 2569 โรงเรียนนิยมศิลป์อนุสรณ์', 'นางอรอุมา  ลักษณะทอง', 1, 1, '2026-04-20 13:15:22'),
(46, 'วช41/69', 'พัฒนางาน 1 อำเภอ 1 โรงเรียนคุณภาพ', 'นางอรอุมา  ลักษณะทอง', 1, 1, '2026-04-20 13:15:22'),
(47, 'บค01/69', 'พัฒนาคุณภาพบุคลากร และการบริหารจัดการงานโรงเรียนนิยมศิลป์อนุสรณ์', 'นางสาวณัฐมล  ภู่สิงห์', 2, 2, '2026-04-20 13:15:22'),
(48, 'บค02/69', 'พัฒนาข้าราชการครูและบุคลากรทางการศึกษาโรงเรียนนิยมศิลป์อนุสรณ์', 'นายสมชาย  เที่ยงดี', 2, 2, '2026-04-20 13:15:22'),
(49, 'บง01/69', 'พัฒนาคุณภาพระบบงานกลุ่มบริหารงบประมาณ', 'นางสาวสมรัศมิ์  สายทอง', 3, 3, '2026-04-20 13:15:22'),
(50, 'บง02/69', 'จ่ายเงินปัจจัยพื้นฐานนักเรียนยากจน และนักเรียนยากจนพิเศษ ปีการศึกษา2569', 'นางสาววรรณิษา สีโถ', 3, 3, '2026-04-20 13:15:22'),
(51, 'บง03/69', 'ส่งเสริมระบบโปรแรมสำนักงาน', 'นางสาวมัทณา  หนูขาว', 3, 3, '2026-04-20 13:15:22'),
(52, 'บง04/69', 'จ่ายเงินอุดหนุนเรียนฟรี 15 ปี ค่าอุปกรณ์การเรียนและค่าเครื่องแบบนักเรียน ปีการศึกษา2569', 'นางสาวสุธิตา  รัตนทอง', 3, 3, '2026-04-20 13:15:22'),
(53, 'บง05/69', 'ส่งเสริมพัฒนาการบริการเทคโนโลยีสารสนเทศและการสื่อสาร', 'นางสาววรกานต์  สุดาจันทร์', 3, 3, '2026-04-20 13:15:22'),
(54, 'บท01/69', 'พัฒนาสำนักงานแผนงานกลุ่มบริหารทั่วไป', 'นางสาวภัคธีมา  แก้วยม', 4, 4, '2026-04-20 13:15:22'),
(55, 'บท02/69', 'การบำรุงรักษาระบบไฟฟ้าส่วนกลาง และอุปกรณ์เทคโนโลยีเพื่อการจัดการเรียนรู้', 'นางสาวปิยาภรณ์  สีหาปัญญา', 4, 4, '2026-04-20 13:15:22'),
(56, 'บท03/69', 'พัฒนางานเทคโนโลยีทางการศึกษาและบันทึกภาพ', 'นายชัชวานนท์  สงคราม', 4, 4, '2026-04-20 13:15:22'),
(57, 'บท04/69', 'พัฒนานักเรียนแกนนำโรงเรียนปลอดขยะ', 'นางสาวกานต์รวี  สารไชย', 4, 4, '2026-04-20 13:15:22'),
(58, 'บท05/69', 'พัฒนาดูแลอาคารสถานที่และสภาพแวดล้อม', 'นายมาโนช  ทัตเศษ', 4, 4, '2026-04-20 13:15:22'),
(59, 'บท06/69', 'ส่งเสริมและสนับสนุนความสัมพันธ์ระหว่างโรงเรียนและชุมชน', 'นางรวีวรรณ  โชคชัยชีวากร', 4, 4, '2026-04-20 13:15:22'),
(60, 'บท07/69', 'ทัศนศึกษาแหล่งเรียนรู้นักเรียน', 'นายมาโนช  ทัตเศษ', 4, 4, '2026-04-20 13:15:22'),
(61, 'บท08/69', 'ส่งเสริมกิจกรรมวันสำคัญ', 'นางสาวปภัทรภรณ์  ถาวรกูล', 4, 4, '2026-04-20 13:15:22'),
(62, 'บท09/69', 'ส่งเสริมงานพิธีการในสถานศึกษา', 'นางสาวปภัทรภรณ์  ถาวรกูล', 4, 4, '2026-04-20 13:15:22'),
(63, 'บท10/69', 'ส่งเสริมอนามัยโรงเรียน', 'นายอรุณโรจน์  บัวคำโคตร', 4, 4, '2026-04-20 13:15:22'),
(64, 'บท11/69', 'จัดซื้อวัสดุอุปกรณ์ในการดำเนินกิจกรรมซ่อมแซม ปรับปรุงพัฒนาการสื่อสารระบบเสียง', 'นายทวีศักดิ์  สินทรัพย์', 4, 4, '2026-04-20 13:15:22'),
(65, 'บท12/69', 'พัฒนาระบบเครือข่ายสัญญาณอินเทอร์เน็ต', 'นายทวีศักดิ์  สินทรัพย์', 4, 4, '2026-04-20 13:15:22'),
(66, 'บท13/69', 'พัฒนาระบบงานลูกจ้าง', 'นายทวีศักดิ์  สินทรัพย์', 4, 4, '2026-04-20 13:15:22'),
(67, 'บท14/69', 'บูรณาการการจัดการศึกษามุ่งสู่โรงเรียนคุณภาพ ปีการศึกษา 2569 (สำรองจ่าย)', 'นางเพลิน  แก้วสุข', 4, 4, '2026-04-20 13:15:22'),
(68, 'บท15/69', 'พัฒนา ปรับปรุงระบบรางระบายน้ำ (เหลือจ่าย 2/68)', 'นางเพลิน  แก้วสุข', 4, 4, '2026-04-20 13:15:22'),
(69, 'กจ01/69', 'ทูบีนัมเบอร์วัน', 'นายสุรวิชญ์  ชิตทอง', 5, 5, '2026-04-20 13:15:22'),
(70, 'กจ02/69', 'ค่ายพุทธบุตร', 'นางสาวสุนาพร  ดวงใจ', 5, 5, '2026-04-20 13:15:22'),
(71, 'กจ03/69', 'งานส่งเสริมงานปกครอง', 'นายอนุพงษ์  สีสัตย์ซื่อ', 5, 5, '2026-04-20 13:15:22'),
(72, 'กจ04/69', 'ส่งเสริมประชาธิปไตยในโรงเรียน', 'นางสาวปนัดดา  กองมนต์', 5, 5, '2026-04-20 13:15:22'),
(73, 'กจ05/69', 'พัฒนาสำนักงานและแผนงานกลุ่มบริหารกิจการนักเรียน', 'นางสาววรรณพร  เหล่ามงคล', 5, 5, '2026-04-20 13:15:22'),
(74, 'กจ06/69', 'สถานศึกษาปลอดภัย', 'นายปริญญา  ดีนอก', 5, 5, '2026-04-20 13:15:22'),
(75, 'กจ07/69', 'ส่งเสริมคุณธรรมจริยธรรมให้กับนักเรียน ปีการศึกษา 2569', 'นายโสภณ  ท้วมโชติ', 5, 5, '2026-04-20 13:15:22'),
(76, 'กจ08/69', 'สถานศึกษาสีขาว', 'นายนพดล  คล้ายใจตรง', 5, 5, '2026-04-20 13:15:22'),
(77, 'กจ09/69', 'ส่งเสริมระบบดูแลช่วยเหลือนักเรียน ปีการศึกษา2569', 'นางสาวกนกธรณ์  สร้อยโต', 5, 5, '2026-04-20 13:15:22'),
(78, 'รศ01/69', 'การสนับสนุนค่าจ้างบุคลากรที่ปฏิบัติงานในสถานศึกษา', 'นางสาวรัตติกาล  บัวระพา', 2, 2, '2026-04-20 13:15:22'),
(79, 'รศ02/69', 'ประกันอุบัติเหตุนักเรียน', 'นางสาวเปรมจิต  เพชรดี', 4, 4, '2026-04-20 13:15:22'),
(80, 'รศ03/69', 'พัฒนาระบบดูแลช่วยเหลือนักเรียนด้วยอิเล็กทรอนิกส์', 'นายสมาน  ทวีผล', 5, 5, '2026-04-20 13:15:22'),
(81, 'รศ04/69', 'พัฒนาแหล่งเรียนรู้ภายในสถานศึกษา ประจำปีการศึกษา 2569', 'นายพิพัฒณ์พล  เนตรทิพย์', 4, 4, '2026-04-20 13:15:22'),
(82, 'รศ05/69', 'พัฒนาทักษะทางภาษาและวัฒนธรรมจีน', 'นางสาวมณธิชา  สิทธิยศ', 1, 1, '2026-04-20 13:15:22'),
(83, 'รศ06/69', 'พัฒนาการสอนภาษาอังกฤษโดยเจ้าของภาษา (ภาษาอังกฤษ)', 'นางสมฤดี  สุทธหลวง', 1, 1, '2026-04-20 13:15:22'),
(84, 'รศ07/69', 'ส่งเสริมความเป็นเลิศห้องเรียนพิเศษทางวิทยาศาสตร์ ภาษาอังกฤษ และคณิตศาสตร์ (ห้องเรียนพิเศษ SEM)', 'นายชัยภัค  เทียนทอง', 1, 1, '2026-04-20 13:15:22'),
(85, 'รศ08/69', 'ส่งเสริมความเป็นเลิศห้องเรียนคุณภาพทางวิทยาศาสตร์ ภาษาอังกฤษและคณิตศาสตร์ (ห้องเรียนSEM)', 'นายชัยภัค  เทียนทอง', 1, 1, '2026-04-20 13:15:22'),
(86, 'รศ09/69', 'พัฒนาทักษะทางภาษาต่างประเทศ (ภาษาที่สาม)', 'นางสมฤดี  สุทธหลวง', 1, 1, '2026-04-20 13:15:22'),
(87, 'รศ10/69', 'หลักสูตรพิเศษเพื่อการเรียนการสอนด้านคอมพิวเตอร์ และเทคโนโลยี 2569', 'นายทวีศักดิ์  สินทรัพย์', 1, 1, '2026-04-20 13:15:22'),
(88, 'รศ11/69', 'พัฒนาระบบโภชนาการนักเรียนปีการศึกษา 2569', 'นางสุกัญญา  จุมพรม', 4, 4, '2026-04-20 13:15:22');

-- --------------------------------------------------------

--
-- Table structure for table `refs`
--

CREATE TABLE `refs` (
  `id` int(11) NOT NULL,
  `ref_id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `color` varchar(255) NOT NULL,
  `ref_group_id` int(11) DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Dumping data for table `refs`
--

INSERT INTO `refs` (`id`, `ref_id`, `title`, `color`, `ref_group_id`, `created_at`) VALUES
(1, 1, 'นาย', 'primary', 1, '2021-02-28 20:16:09'),
(2, 2, 'นาง', 'info', 1, '2021-02-28 20:16:09'),
(3, 3, 'นางสาว', 'danger', 1, '2021-02-28 20:16:09'),
(4, 4, 'ว่าที่ร้อยตรี', 'warning', 1, '2021-02-28 20:16:09'),
(5, 5, 'ดร.', 'warning', 1, '2021-02-28 20:16:09'),
(6, 6, 'อื่น ๆ', 'warning', 1, '2021-02-28 20:16:09'),
(7, 1, 'จัดซื้อ', 'warning', 5, '2021-02-28 20:16:09'),
(8, 2, 'จัดจ้าง', 'info', 5, '2021-02-28 20:16:09'),
(11, 11, 'จัดซื้อ (อุปกรณ์อิเล็กทรอนิกส์)', 'info', 2, '2022-10-23 20:43:56'),
(12, 12, 'จัดซื้อ (ครุภัณฑ์สำนักงาน)', 'info', 2, '2022-10-23 20:43:56'),
(13, 13, 'จัดซื้อ (วัสดุสำนักงาน)', 'info', 2, '2022-10-23 20:43:56'),
(14, 14, 'จัดซื้อ (อุปกรณ์เครื่องมือช่าง)', 'info', 2, '2022-10-23 20:43:56'),
(19, 19, 'จัดซื้อ (อื่นๆ)', 'info', 2, '2022-10-23 20:43:56'),
(21, 21, 'จัดจ้าง (เหมารถ)', 'info', 2, '2022-10-23 20:43:56'),
(22, 22, 'จัดจ้าง (วิทยากร)', 'info', 2, '2022-10-23 20:43:56'),
(23, 23, 'จัดจ้าง (อาหารว่างและเครื่องดื่ม)', 'info', 2, '2022-10-23 20:43:56'),
(29, 29, 'จัดจ้าง (อื่นๆ)', 'info', 2, '2022-10-23 20:43:56'),
(31, 31, 'จ่ายเงินเดือน/ค่าจ้างประจำ', 'info', 2, '2022-05-26 09:06:56'),
(32, 32, 'จ่ายเงินสมทบประกันสังคม', 'info', 2, '2022-05-26 09:06:56'),
(33, 33, 'ชำระค่าสาธารณูปโภค', 'primary', 2, '2021-02-28 20:16:09'),
(34, 34, 'ไปราชการ', 'info', 2, '2021-02-28 20:16:09'),
(35, 35, 'เช่าบริการ', 'warning', 2, '2021-02-28 20:16:09'),
(36, 36, 'มอบทุนการศึกษา', 'info', 2, '2021-02-28 20:29:34'),
(37, 37, 'จ่ายเบี้ยประชุม', 'info', 2, '2022-06-29 13:53:39'),
(51, 1, 'แผนงาน', 'info', 3, '2021-02-28 20:32:51'),
(52, 2, 'ฝ่ายบริหาร', 'primary', 3, '2021-02-28 20:16:09'),
(53, 3, 'รับเอกสารดำเนิการ', 'info', 3, '2021-02-28 20:16:09'),
(54, 4, 'รับเอกสารจากพัสดุ', 'info', 3, '2021-06-10 15:38:07'),
(55, 5, 'รับเช็คการเงิน', 'warning', 3, '2021-06-10 15:39:57');

-- --------------------------------------------------------

--
-- Table structure for table `ref_groups`
--

CREATE TABLE `ref_groups` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Dumping data for table `ref_groups`
--

INSERT INTO `ref_groups` (`id`, `title`, `created_at`) VALUES
(1, 'คำนำหน้า', '2021-02-28 20:15:13'),
(2, 'ประเภทใช้เงิน', '2021-02-28 20:15:13'),
(3, 'สถานะดำเนินการ', '2021-02-28 20:15:13'),
(4, 'แผนการเรียน', '2021-02-28 20:15:13');

-- --------------------------------------------------------

--
-- Table structure for table `role`
--

CREATE TABLE `role` (
  `role_id` int(11) NOT NULL,
  `role_name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Dumping data for table `role`
--

INSERT INTO `role` (`role_id`, `role_name`) VALUES
(1, 'ผู้ดูแลระบบ'),
(2, 'ผู้ปฏิบัติงาน'),
(3, 'เจ้าหน้าที่การเงิน'),
(4, 'เจ้าหน้าที่พัสดุ'),
(5, 'เจ้าหน้าที่'),
(6, 'หัวหน้ากลุ่ม'),
(7, 'แผนงานกลุ่ม'),
(8, 'ผู้ใช้ทั่วไป'),
(9, 'รออนุมัติ');

-- --------------------------------------------------------

--
-- Table structure for table `setting`
--

CREATE TABLE `setting` (
  `set_id` int(1) NOT NULL,
  `sys_name` varchar(255) NOT NULL,
  `school_name` varchar(255) NOT NULL,
  `logo_url` varchar(255) NOT NULL,
  `title_name` varchar(255) NOT NULL,
  `year_name` varchar(255) NOT NULL,
  `dir_name` varchar(255) NOT NULL,
  `man_name` varchar(255) NOT NULL,
  `plan_name` varchar(255) NOT NULL,
  `menu_project` int(1) NOT NULL,
  `menu_activity` int(1) NOT NULL,
  `menu_payplan` int(1) NOT NULL,
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `setting`
--

INSERT INTO `setting` (`set_id`, `sys_name`, `school_name`, `logo_url`, `title_name`, `year_name`, `dir_name`, `man_name`, `plan_name`, `menu_project`, `menu_activity`, `menu_payplan`, `created_at`) VALUES
(1, 'NaBudget', 'โรงเรียนนิยมศิลป์อนุสรณ์', '/assets/images/logo/logo_main.png', 'โรงเรียนนิยมศิลป์อนุสรณ์ อำเภอวิเชียรบุรี จังหวัดเพชรบูรณ์ 67130', 'ปีการศึกษา 2569', 'นายธนัญชัย พรหมภักดี', 'นายตฤณกร แก้วศรีงาม', 'นายกฤษฎิ์ไกรวิชญ์ จันทรัตน์', 0, 0, 1, '2026-05-02 10:31:18');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(10) UNSIGNED NOT NULL,
  `person_id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `role` varchar(2) DEFAULT '9' COMMENT '9 ค่าเริ่มต้นรออนุมัติในกรณีที่ขอใช้งาน',
  `remember_token` varchar(255) DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `person_id`, `username`, `email`, `password`, `role`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 1, 'budget@admin.com', 'budget@admin.com', '$2y$10$pctKbOWfhfzBWN7arSDobetOQ.Z/bhhq826eN4Ao1CIxECM3Hj17.', '1', NULL, '2026-04-20 14:11:20', NULL),
(2, 2, 'admin@na.ac.th', 'admin@na.ac.th', '$2y$10$pS7r6XnI7263erziAsQWFuWlJ0.EEPQKpA51Ws72nEDitaXttCRz2', '1', NULL, '2026-04-20 16:47:59', NULL),
(3, 3, 'siraprapa@na.ac.th', 'siraprapa@na.ac.th', '$2y$10$zJ6ee9XBNuwy/1VpK9O1kuz1r.bmuoRdoxqhQEI3NIIMZj14crrXS', '8', NULL, '2026-05-01 15:10:26', NULL),
(4, 4, 'krit@na.ac.th', 'krit@na.ac.th', '$2y$10$yBcs8H9UM9I0wzc3af1Hf.7KoAbg9W.oCnIDyKqsDS7olixZhnqyy', '7', NULL, '2026-05-01 15:23:26', NULL),
(5, 5, 'malisa@na.ac.th', 'malisa@na.ac.th', '$2y$10$/8CLnqO9DyGrq.V8CSAYN.1Aga6d140XUoXp3bO.6V5X8hQHqM/OG', '7', NULL, '2026-05-01 15:26:31', NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `activity`
--
ALTER TABLE `activity`
  ADD PRIMARY KEY (`act_id`);

--
-- Indexes for table `budgettype`
--
ALTER TABLE `budgettype`
  ADD PRIMARY KEY (`bgt_id`);

--
-- Indexes for table `department`
--
ALTER TABLE `department`
  ADD PRIMARY KEY (`dep_id`);

--
-- Indexes for table `management`
--
ALTER TABLE `management`
  ADD PRIMARY KEY (`man_id`);

--
-- Indexes for table `payplan`
--
ALTER TABLE `payplan`
  ADD PRIMARY KEY (`pay_id`);

--
-- Indexes for table `persons`
--
ALTER TABLE `persons`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `project`
--
ALTER TABLE `project`
  ADD PRIMARY KEY (`pro_id`);

--
-- Indexes for table `refs`
--
ALTER TABLE `refs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `ref_groups`
--
ALTER TABLE `ref_groups`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `role`
--
ALTER TABLE `role`
  ADD PRIMARY KEY (`role_id`);

--
-- Indexes for table `setting`
--
ALTER TABLE `setting`
  ADD PRIMARY KEY (`set_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `activity`
--
ALTER TABLE `activity`
  MODIFY `act_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัสกิจกรรม', AUTO_INCREMENT=415;

--
-- AUTO_INCREMENT for table `budgettype`
--
ALTER TABLE `budgettype`
  MODIFY `bgt_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `department`
--
ALTER TABLE `department`
  MODIFY `dep_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัสกลุ่ม', AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT for table `payplan`
--
ALTER TABLE `payplan`
  MODIFY `pay_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัสการเบิกเงินตามแผน';

--
-- AUTO_INCREMENT for table `persons`
--
ALTER TABLE `persons`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `project`
--
ALTER TABLE `project`
  MODIFY `pro_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัสโครงการ', AUTO_INCREMENT=89;

--
-- AUTO_INCREMENT for table `ref_groups`
--
ALTER TABLE `ref_groups`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `role`
--
ALTER TABLE `role`
  MODIFY `role_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
